betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32h417.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/03/01
* Description        : CH32H417 Device Peripheral Access Layer Header File.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/  
#ifndef __CH32H417_H
#define __CH32H417_H

#ifdef __cplusplus
 extern "C" {
#endif 

#define __MPU_PRESENT             0 /* Other CH32 devices does not provide an MPU */
#define __Vendor_SysTickConfig    0 /* Set to 1 if different SysTick Config is used */	 
	 
#ifndef HSE_VALUE
#define HSE_VALUE    ((uint32_t)25000000) /* Value of the External oscillator in Hz */
#endif

/* In the following line adjust the External High Speed oscillator (HSE) Startup Timeout value */
#define HSE_STARTUP_TIMEOUT   ((uint16_t)0x10000) /* Time out for HSE start up */

#define HSI_VALUE    ((uint32_t)25000000) /* Value of the Internal oscillator in Hz */

/* CH32H417 Standard Peripheral Library version number */
#define __CH32H417_STDPERIPH_VERSION_MAIN   (0x01) /* [15:8] main version */
#define __CH32H417_STDPERIPH_VERSION_SUB    (0x00) /* [7:0] sub version */
#define __CH32H417_STDPERIPH_VERSION        ( (__CH32H417_STDPERIPH_VERSION_MAIN << 8)\
                                             |(__CH32H417_STDPERIPH_VERSION_SUB << 0))


/* Interrupt Number Definition, according to the selected device */	 
typedef enum IRQn
{
 /******  RISC-V Processor Exceptions Numbers *******************************************************/
  NonMaskableInt_IRQn         = 2,       /* 2 Non Maskable Interrupt                             */
  HardFault_IRQn              = 3,       /* 3 HardFault Interrupt                                */
  Ecall_M_Mode_IRQn           = 5,       /* 5 Ecall M Mode Interrupt                             */
  Ecall_U_Mode_IRQn           = 8,       /* 8 Ecall U Mode Interrupt                             */
  Break_Point_IRQn            = 9,       /* 9 Break Point Interrupt                              */
  SysTick0_IRQn               = 12,      /* 12 System timer 0 Interrupt                          */
  SysTick1_IRQn               = 13,      /* 13 System timer 1 Interrupt                          */
  Software_IRQn               = 14,      /* 14 software Interrupt                                */
  IPC_CH0_IRQn                = 16,      /* 16 IPC CH0 Interrupt                                 */
  IPC_CH1_IRQn                = 17,      /* 17 IPC CH1 Interrupt                                 */
  IPC_CH2_IRQn                = 18,      /* 18 IPC CH2 Interrupt                                 */
  IPC_CH3_IRQn                = 19,      /* 19 IPC CH3 Interrupt                                 */
  HSEM_IRQn                   = 28,      /* 28 HSEM Interrupt                                    */

 /******  RISC-V specific Interrupt Numbers *********************************************************/
  WWDG_IRQn                   = 32,      /* Window WatchDog Interrupt                            */
  EXTI15_8_IRQn               = 33,      /* External Line[15:8] Interrupts                       */
  FLASH_IRQn                  = 34,      /* FLASH global Interrupt                               */
  RCC_IRQn                    = 35,      /* RCC global Interrupt                                 */
  EXTI7_0_IRQn                = 36,      /* External Line[7:0] Interrupts                        */
  SPI1_IRQn                   = 37,      /* SPI1 global Interrupt                                */
  DMA1_Channel2_IRQn          = 38,      /* DMA1 Channel 2 global Interrupt                      */
  DMA1_Channel3_IRQn          = 39,      /* DMA1 Channel 3 global Interrupt                      */
  DMA1_Channel4_IRQn          = 40,      /* DMA1 Channel 4 global Interrupt                      */
  DMA1_Channel5_IRQn          = 41,      /* DMA1 Channel 5 global Interrupt                      */
  DMA1_Channel6_IRQn          = 42,      /* DMA1 Channel 6 global Interrupt                      */
  DMA1_Channel7_IRQn          = 43,      /* DMA1 Channel 7 global Interrupt                      */
  DMA1_Channel8_IRQn          = 44,      /* DMA1 Channel 8 global Interrupt                      */
  USART2_IRQn                 = 45,      /* USART2 global Interrupt                              */
  I2C1_EV_IRQn                = 46,      /* I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn                = 47,      /* I2C1 Error Interrupt                                 */
  USART1_IRQn                 = 48,      /* USART1 global Interrupt                              */
  SPI2_IRQn                   = 49,      /* SPI2 global Interrupt                                */
  SPI3_IRQn                   = 50,      /* SPI3 global Interrupt                                */
  SPI4_IRQn                   = 51,      /* SPI4 global Interrupt                                */
  I2C2_EV_IRQn                = 52,      /* I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn                = 53,      /* I2C2 Error Interrupt                                 */
  USBPD_IRQn                  = 54,      /* USBPD Interrupt                                      */
  USBPDWakeUp_IRQn            = 55,      /* USBPD WakeUp Interrupt                               */
  USBHS_IRQn                  = 56,      /* USBHS global Interrupt                               */
  DMA1_Channel1_IRQn          = 57,      /* DMA1 Channel 1 global Interrupt                      */
  CAN1_SCE_IRQn               = 58,      /* CAN1 SCE Interrupt                                   */
  CAN1_TX_IRQn                = 59,      /* CAN1 TX Interrupts                                   */
  CAN1_RX0_IRQn               = 60,      /* CAN1 RX0 Interrupts                                  */
  USBSS_IRQn                  = 62,      /* USBSS Interrupt                                      */  
  USBSS_LINK_IRQn             = 63,      /* USBSS LINK Interrupt                                 */
  USBHSWakeup_IRQn            = 64,      /* USBHS WakeUp Interrupt                               */
  USBSSWakeup_IRQn            = 65,      /* USBSS WakeUp Interrupt                               */
  RTCAlarm_IRQn               = 66,      /* RTC Alarm through EXTI Line Interrupt                */
  USBFS_IRQn                  = 67,      /* USBFS global Interrupt                               */
  USBFSWakeUp_IRQn            = 68,      /* USBFS WakeUp Interrupt                               */
  ADC1_2_IRQn                 = 69,      /* ADC1 and ADC2 global Interrupt                       */
  TIM1_BRK_IRQn               = 70,      /* TIM1 Break Interrupt                                 */
  TIM1_UP_IRQn                = 71,      /* TIM1 Update Interrupt                                */
  TIM1_TRG_COM_IRQn           = 72,      /* TIM1 Trigger and Commutation Interrupt               */
  TIM1_CC_IRQn                = 73,      /* TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn                   = 74,      /* TIM2 global Interrupt                                */
  TIM3_IRQn                   = 75,      /* TIM3 global Interrupt                                */
  TIM4_IRQn                   = 76,      /* TIM4 global Interrupt                                */
  TIM5_IRQn                   = 77,      /* TIM5 global Interrupt                                */
  I2C3_EV_IRQn                = 78,      /* I2C3 Event Interrupt                                 */
  I2C3_ER_IRQn                = 79,      /* I2C3 Error Interrupt                                 */
  I2C4_EV_IRQn                = 80,      /* I2C4 Event Interrupt                                 */
  I2C4_ER_IRQn                = 81,      /* I2C4 Error Interrupt                                 */
  QSPI1_IRQn                  = 82,      /* QSPI1 Interrupt                                      */
  SERDES_IRQn                 = 83,      /* SERDES Interrupt                                     */
  USART3_IRQn                 = 84,      /* USART3 global Interrupt                              */
  USART4_IRQn                 = 85,      /* USART4 global Interrupt                              */
  TIM8_BRK_IRQn               = 86,      /* TIM8 Break Interrupt                                 */
  TIM8_UP_IRQn                = 87,      /* TIM8 Update Interrupt                                */
  TIM8_TRG_COM_IRQn           = 88,      /* TIM8 Trigger and Commutation Interrupt               */
  TIM8_CC_IRQn                = 89,      /* TIM8 Capture Compare Interrupt                       */
  TIM9_IRQn                   = 90,      /* TIM9 global Interrupt                                */
  TIM10_IRQn                  = 91,      /* TIM10 global Interrupt                               */
  TIM11_IRQn                  = 92,      /* TIM11 global Interrupt                               */
  TIM12_IRQn                  = 93,      /* TIM12 global Interrupt                               */
  FMC_IRQn                    = 94,      /* FMC global Interrupt                                 */
  SDMMC_IRQn                  = 95,      /* SDMMC global Interrupt                               */
  LPTIM1_IRQn                 = 96,      /* LPTIM1 global Interrupt                              */
  LPTIM2_IRQn                 = 97,      /* LPTIM2 global Interrupt                              */
  USART5_IRQn                 = 98,      /* USART5 global Interrupt                              */
  USART6_IRQn                 = 99,      /* USART6 global Interrupt                              */
  TIM6_IRQn                   = 100,     /* TIM6 global Interrupt                                */
  TIM7_IRQn                   = 101,     /* TIM7 global Interrupt                                */
  DMA2_Channel1_IRQn          = 102,     /* DMA2 Channel 1 global Interrupt                      */
  DMA2_Channel2_IRQn          = 103,     /* DMA2 Channel 2 global Interrupt                      */
  DMA2_Channel3_IRQn          = 104,     /* DMA2 Channel 3 global Interrupt                      */
  DMA2_Channel4_IRQn          = 105,     /* DMA2 Channel 4 global Interrupt                      */
  DMA2_Channel5_IRQn          = 106,     /* DMA2 Channel 5 global Interrupt                      */
  DMA2_Channel6_IRQn          = 107,     /* DMA2 Channel 6 global Interrupt                      */
  DMA2_Channel7_IRQn          = 108,     /* DMA2 Channel 7 global Interrupt                      */
  DMA2_Channel8_IRQn          = 109,     /* DMA2 Channel 8 global Interrupt                      */
  ETH_IRQn                    = 110,     /* ETH global Interrupt                                 */
  ETH_WKUP_IRQn               = 111,     /* ETH WakeUp Interrupt                                 */
  CAN2_SCE_IRQn               = 112,     /* CAN2 SCE Interrupt                                   */
  CAN2_TX_IRQn                = 113,     /* CAN2 TX Interrupts                                   */
  CAN2_RX0_IRQn               = 114,     /* CAN2 RX0 Interrupts                                  */  
  USART7_IRQn                 = 116,     /* USART7 global Interrupt                              */
  USART8_IRQn                 = 117,     /* USART8 global Interrupt                              */
  I3C_EV_IRQn                 = 118,     /* I3C Event Interrupt                                  */
  I3C_ER_IRQn                 = 119,     /* I3C Error Interrupt                                  */
  DVP_IRQn                    = 120,     /* DVP global Interrupt                                 */
  ECDC_IRQn                   = 121,     /* ECDC global Interrupt                                 */
  PIOC_IRQn                   = 122,     /* PIOC global Interrupt                                */
  SAI_IRQn                    = 123,     /* SAI global Interrupt                                 */
  LTDC_IRQn                   = 124,     /* LTDC global Interrupt                                */
  GPHA_IRQn                   = 125,     /* GPHA global Interrupt                                */
  DFSDM0_IRQn                 = 127,     /* DFSDM0 global Interrupt                              */
  DFSDM1_IRQn                 = 128,     /* DFSDM1 global Interrupt                              */
  SWPMI_IRQn                  = 131,     /* SWPMI global Interrupt                               */
  QSPI2_IRQn                  = 134,     /* QSPI2 Interrupt                                      */
  SWPMI_WKUP_IRQn             = 135,     /* SWPMI WakeUp Interrupt                               */
  CAN3_SCE_IRQn               = 136,     /* CAN3 SCE Interrupt                                   */
  CAN3_TX_IRQn                = 137,     /* CAN3 TX Interrupts                                   */
  CAN3_RX0_IRQn               = 138,     /* CAN3 RX0 Interrupts                                  */
  LPTIM2_WKUP_IRQn            = 140,     /* LPTIM2 WakeUp Interrupt                              */
  LPTIM1_WKUP_IRQn            = 141,     /* LPTIM1 WakeUp Interrupt                              */
  I3C_WKUP_IRQn               = 142,     /* I3C WakeUp Interrupt                                 */
  RTC_IRQn                    = 143,     /* RTC global Interrupt                                 */
  HSADC_IRQn                  = 144,     /* HSADC global Interrupt                               */
  UHSIF_IRQn                  = 145,     /* UHSIF global Interrupt                               */
  RNG_IRQn                    = 146,     /* RNG global Interrupt                                 */
  SDIO_IRQn                   = 147,     /* SDIO global Interrupt                                */
  USART_WKUP_IRQn             = 148,     /* USART wakeup Interrupt                               */
} IRQn_Type;

#include <stdint.h>
#include "core_riscv.h"
#include "system_ch32h417.h"


/* Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSI_Value            HSI_VALUE 
#define HSE_Value            HSE_VALUE
#define HSEStartUp_TimeOut   HSE_STARTUP_TIMEOUT

/* Analog to Digital Converter */
typedef struct
{
  __IO uint32_t STATR;
  __IO uint32_t CTLR1;
  __IO uint32_t CTLR2;
  __IO uint32_t SAMPTR1;
  __IO uint32_t SAMPTR2;
  __IO uint32_t IOFR1;
  __IO uint32_t IOFR2;
  __IO uint32_t IOFR3;
  __IO uint32_t IOFR4;
  __IO uint32_t WDHTR;
  __IO uint32_t WDLTR;
  __IO uint32_t RSQR1;
  __IO uint32_t RSQR2;
  __IO uint32_t RSQR3;
  __IO uint32_t ISQR;
  __IO uint32_t IDATAR1;
  __IO uint32_t IDATAR2;
  __IO uint32_t IDATAR3;
  __IO uint32_t IDATAR4;
  __IO uint32_t RDATAR;
  uint32_t  RESERVED0;
  __IO uint32_t AUX;
  __IO uint32_t DRV;
} ADC_TypeDef;

/* Controller Area Network TxMailBox */
typedef struct
{
  __IO uint32_t TXMIR;
  __IO uint32_t TXMDTR;
  __IO uint32_t TXMDLR;
  __IO uint32_t TXMDHR;
} CAN_TxMailBox_TypeDef;

/* Controller Area Network FIFOMailBox */ 
typedef struct
{
  __IO uint32_t RXMIR;
  __IO uint32_t RXMDTR;
  __IO uint32_t RXMDLR;
  __IO uint32_t RXMDHR;
} CAN_FIFOMailBox_TypeDef;

