betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/* Controller Area Network */  
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t STATR;
  __IO uint32_t TSTATR;
  __IO uint32_t RFIFO0;
  uint32_t RESERVED0;
  __IO uint32_t INTENR;
  __IO uint32_t ERRSR;
  __IO uint32_t BTIMR;
  __IO uint32_t TTCTLR;
  __IO uint32_t TTCNT;
  __IO uint32_t TERR_CNT;
  uint32_t  RESERVED1[85];
  CAN_TxMailBox_TypeDef sTxMailBox[3];
  CAN_FIFOMailBox_TypeDef sFIFOMailBox[1];
} CAN_TypeDef;

/* CRC Calculation Unit */
typedef struct
{
  __IO uint32_t DATAR;
  __IO uint8_t  IDATAR;
  uint8_t   RESERVED0;
  uint16_t  RESERVED1;
  __IO uint32_t CTLR;
} CRC_TypeDef;

/* Digital to Analog Converter */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t SWTR;
  __IO uint32_t R12BDHR1;
  __IO uint32_t L12BDHR1;
  __IO uint32_t R8BDHR1;
  __IO uint32_t R12BDHR2;
  __IO uint32_t L12BDHR2;
  __IO uint32_t R8BDHR2;
  __IO uint32_t RD12BDHR;
  __IO uint32_t LD12BDHR;
  __IO uint32_t RD8BDHR;
  __IO uint32_t DOR1;
  __IO uint32_t DOR2;
} DAC_TypeDef;

/* DMA Channel Controller */
typedef struct
{
  __IO uint32_t CFGR;
  __IO uint32_t CNTR;
  __IO uint32_t PADDR;
  __IO uint32_t MADDR;
  __IO uint32_t M1ADDR;
} DMA_Channel_TypeDef;

/* DMA Controller */
typedef struct
{
  __IO uint32_t INTFR;
  __IO uint32_t INTFCR;
} DMA_TypeDef;

/* DMA MUX Controller */
typedef struct
{
  __IO uint32_t CFGR0_3;
  __IO uint32_t CFGR4_7;
  __IO uint32_t CFGR8_11;
  __IO uint32_t CFGR12_15;
} DMAMUX_TypeDef;

typedef struct
{
  /**
    * @brief dma muxctrl register
    */
  union
  {
    __IO uint8_t MUXCTL;
    struct
    {
      __IO uint8_t reqsel               : 7; /* [6:0] */
      __IO uint8_t reserved             : 1; /* [7] */
    }muxctrl_bit;
  };
} dmamux_channel_type;

/* External Interrupt/Event Controller */
typedef struct
{
  __IO uint32_t INTENR; 
  __IO uint32_t EVENR;   
  __IO uint32_t RTENR;   
  __IO uint32_t FTENR;   
  __IO uint32_t SWIEVR;  
  __IO uint32_t INTFR;   
} EXTI_TypeDef;

/* FLASH Registers */
typedef struct
{
  __IO uint32_t ACTLR;
  __IO uint32_t KEYR;
  __IO uint32_t OBKEYR;
  __IO uint32_t STATR;
  __IO uint32_t CTLR;
  __IO uint32_t ADDR;
  uint32_t RESERVED;
  __IO uint32_t OBR;
  __IO uint32_t WPR;
  __IO uint32_t MODEKEYR;
  __IO uint32_t BOOT_MODEKEYR;
} FLASH_TypeDef;

/* Option Bytes Registers */  
typedef struct
{
  __IO uint16_t RDPR;
  __IO uint16_t USER;
  __IO uint16_t Data0;
  __IO uint16_t Data1;
  __IO uint16_t WRPR0;
  __IO uint16_t WRPR1;
  __IO uint16_t WRPR2;
  __IO uint16_t WRPR3;
} OB_TypeDef;

/* FMC Bank1 Registers */  
typedef struct
{
  __IO uint32_t BTCR[8];
} FMC_Bank1_TypeDef;  

/* FMC Bank1E Registers */
typedef struct
{
  __IO uint32_t BWTR[7];
} FMC_Bank1E_TypeDef; //0x40025504

/* FMC Bank3 Registers */
typedef struct
{
  __IO uint32_t PCR;
  __IO uint32_t SR;
  __IO uint32_t PMEM;
  __IO uint32_t PATT;
  uint32_t RESERVED0;
  __IO uint32_t ECCR;
} FMC_Bank3_TypeDef; //0x40025480

/* FMC Bank5_6 Registers */
typedef struct
{
  __IO uint32_t SDCR[2];
  __IO uint32_t SDTR[2];
  __IO uint32_t SDCMR;
  __IO uint32_t SDRTR;
  __IO uint32_t SDSR;
  uint32_t RESERVED0[9];
  __IO uint32_t MISC;
} FMC_Bank5_6_TypeDef; //0x40025540

/* General Purpose I/O */
typedef struct
{
  __IO uint32_t CFGLR;
  __IO uint32_t CFGHR;
  __IO uint32_t INDR;
  __IO uint32_t OUTDR;
  __IO uint32_t BSHR;
  __IO uint32_t BCR;
  __IO uint32_t LCKR;
  __IO uint32_t SPEED;
} GPIO_TypeDef;

/* Alternate Function I/O */
typedef struct
{
  __IO uint32_t PCFR1;
  __IO uint32_t GPIOA_AFLR;
  __IO uint32_t GPIOA_AFHR;
  __IO uint32_t GPIOB_AFLR;
  __IO uint32_t GPIOB_AFHR;
  __IO uint32_t GPIOC_AFLR;
  __IO uint32_t GPIOC_AFHR;
  __IO uint32_t GPIOD_AFLR;
  __IO uint32_t GPIOD_AFHR;
  __IO uint32_t GPIOE_AFLR;
  __IO uint32_t GPIOE_AFHR;
  __IO uint32_t GPIOF_AFLR;
  __IO uint32_t GPIOF_AFHR;
  uint32_t RESERVED0[2];
  __IO uint32_t EXTICR1;
  __IO uint32_t EXTICR2;
} AFIO_TypeDef;

/* Inter Integrated Circuit Interface */
typedef struct
{
  __IO uint16_t CTLR1;
  uint16_t RESERVED0;
  __IO uint16_t CTLR2;
  uint16_t RESERVED1;
  __IO uint16_t OADDR1;
  uint16_t RESERVED2;
  __IO uint16_t OADDR2;
  uint16_t RESERVED3;
  __IO uint16_t DATAR;
  uint16_t RESERVED4;
  __IO uint16_t STAR1;
  uint16_t RESERVED5;
  __IO uint16_t STAR2;
  uint16_t RESERVED6;
  __IO uint16_t CKCFGR;
  uint16_t RESERVED7;
  __IO uint16_t RTR;
  uint16_t RESERVED8;
} I2C_TypeDef;

typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t CFGR;
  uint32_t RESERVED0[2];
  __IO uint32_t RDBR;
  __IO uint32_t RDWR;
  __IO uint32_t TDBR;
  __IO uint32_t TDWR;
  __IO uint32_t IBIDR;
  __IO uint32_t TGTTDR;
  uint32_t RESERVED1;
  __IO uint32_t RESET;
  __IO uint32_t STATR;
  __IO uint32_t STATER;
  uint32_t RESERVED2[2];
  __IO uint32_t RMR;
  uint32_t RESERVED3[3];
  __IO uint32_t EVR;
  __IO uint32_t INTENR;
  __IO uint32_t CEVR;
  uint32_t RESERVED4;
  __IO uint32_t DEVR0;
  __IO uint32_t DEVR1;
  __IO uint32_t DEVR2;
  __IO uint32_t DEVR3;
  __IO uint32_t DEVR4;
  uint32_t RESERVED5[7];
  __IO uint32_t MAXRLR;
  __IO uint32_t MAXWLR;
  uint32_t RESERVED6[2];
  __IO uint32_t TIMINGR0;
  __IO uint32_t TIMINGR1;
  __IO uint32_t TIMINGR2;
  uint32_t RESERVED7[5];
  __IO uint32_t BCR;
  __IO uint32_t DCR;
  __IO uint32_t GETCAPR;
  __IO uint32_t CRCAPR;
  __IO uint32_t GETMDSR;
  __IO uint32_t EPIDR;
} I3C_TypeDef;

/* Independent WatchDog */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t PSCR;
  __IO uint32_t RLDR;
  __IO uint32_t STATR;
} IWDG_TypeDef;

/* Power Control */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t CSR;
} PWR_TypeDef;

/* Reset and Clock Control */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t CFGR0;
  __IO uint32_t PLLCFGR;
  __IO uint32_t INTR;
  __IO uint32_t HB2PRSTR;
  __IO uint32_t HB1PRSTR;
  __IO uint32_t HBPCENR;
  __IO uint32_t HB2PCENR;
  __IO uint32_t HB1PCENR;
  __IO uint32_t BDCTLR;
  __IO uint32_t RSTSCKR;
  __IO uint32_t HBPRSTR;
  __IO uint32_t CFGR2;
  __IO uint32_t PLLCFGR2;
} RCC_TypeDef;

/* Real-Time Clock */
typedef struct
{
  __IO uint16_t CTLRH;
  uint16_t RESERVED0;
  __IO uint16_t CTLRL;
  uint16_t RESERVED1;
  __IO uint16_t PSCRH;
  uint16_t RESERVED2;
  __IO uint16_t PSCRL;
  uint16_t RESERVED3;
  __IO uint16_t DIVH;
  uint16_t RESERVED4;
  __IO uint16_t DIVL;
  uint16_t RESERVED5;
  __IO uint16_t CNTH;
  uint16_t RESERVED6;
  __IO uint16_t CNTL;
  uint16_t RESERVED7;
  __IO uint16_t ALRMH;
  uint16_t RESERVED8;
  __IO uint16_t ALRML;
  uint16_t RESERVED9;
} RTC_TypeDef;

/* SDIO Registers */ 
typedef struct
{
  __IO uint32_t POWER;
  __IO uint32_t CLKCR;
  __IO uint32_t ARG;
  __IO uint32_t CMD;
  __I uint32_t RESPCMD;
  __I uint32_t RESP1;
  __I uint32_t RESP2;
  __I uint32_t RESP3;
  __I uint32_t RESP4;
  __IO uint32_t DTIMER;
  __IO uint32_t DLEN;
  __IO uint32_t DCTRL;
  __I uint32_t DCOUNT;
  __I uint32_t STA;
  __IO uint32_t ICR;
  __IO uint32_t MASK;
  uint32_t RESERVED0[2];
  __I uint32_t FIFOCNT;
  uint32_t RESERVED1[5];
  __IO uint32_t DCTRL2;
  uint32_t RESERVED2[7];
  __IO uint32_t FIFO;
} SDIO_TypeDef;

/* Serial Peripheral Interface */
typedef struct
{
  __IO uint16_t CTLR1;
  uint16_t RESERVED0;
  __IO uint16_t CTLR2;
  uint16_t RESERVED1;
  __IO uint16_t STATR;
  uint16_t RESERVED2;
  __IO uint16_t DATAR;
  uint16_t RESERVED3;
  __IO uint16_t CRCR;
  uint16_t RESERVED4;
  __IO uint16_t RCRCR;
  uint16_t RESERVED5;
  __IO uint16_t TCRCR;
  uint16_t RESERVED6;
  __IO uint16_t I2SCFGR;
  uint16_t RESERVED7;
  __IO uint16_t I2SPR;
  uint16_t RESERVED8;
  __IO uint16_t HSCR;
  uint16_t RESERVED9;
} SPI_TypeDef;

/* TIM */
typedef struct
{
  __IO uint16_t CTLR1;
  uint16_t RESERVED0;
  __IO uint16_t CTLR2;
  uint16_t RESERVED1;
  __IO uint16_t SMCFGR;
  uint16_t RESERVED2;
  __IO uint16_t DMAINTENR;
  uint16_t RESERVED3;
  __IO uint16_t INTFR;
  uint16_t RESERVED4;
  __IO uint16_t SWEVGR;
  uint16_t RESERVED5;
  __IO uint16_t CHCTLR1;
  uint16_t RESERVED6;
  __IO uint16_t CHCTLR2;
  uint16_t RESERVED7;
  __IO uint16_t CCER;
  uint16_t RESERVED8;
  union
  {
    __IO uint32_t CNT_32;  //TIM9,10,11,12
    struct
    {
        __IO uint16_t CNT;
        uint16_t RESERVED9;
    };
  };
  __IO uint16_t PSC;
  uint16_t RESERVED10;
  union
  {
    __IO uint32_t ATRLR_32;//TIM9,10,11,12
    struct
    {
        __IO uint16_t ATRLR;
        uint16_t RESERVED11;
    };
  };
  __IO uint16_t RPTCR;
  uint16_t RESERVED12;
  union
  {
    __IO uint32_t CH1CVR_32;
    struct
    {
        __IO uint16_t CH1CVR;
        uint16_t RESERVED13;
    };
  };
    union
  {
    __IO uint32_t CH2CVR_32;
    struct
    {
        __IO uint16_t CH2CVR;
        uint16_t RESERVED14;
    };
  };
  union
  {
    __IO uint32_t CH3CVR_32;
    struct
    {
        __IO uint16_t CH3CVR;
        uint16_t RESERVED15;
    };
  };
  union
  {
    __IO uint32_t CH4CVR_32;
    struct
    {
        __IO uint16_t CH4CVR;
        uint16_t RESERVED16;
    };
  };
  __IO uint16_t BDTR;
  uint16_t RESERVED17;
  __IO uint16_t DMACFGR;
  uint16_t RESERVED18;
  __IO uint16_t DMAADR;
  uint16_t RESERVED19;
  __IO uint16_t AUX;
  uint16_t RESERVED20;
} TIM_TypeDef;

/* Universal Synchronous Asynchronous Receiver Transmitter */
typedef struct
{
  __IO uint16_t STATR;
  uint16_t RESERVED0;
  __IO uint16_t DATAR;
  uint16_t RESERVED1;
  __IO uint16_t BRR;
  uint16_t RESERVED2;
  __IO uint16_t CTLR1;
  uint16_t RESERVED3;
  __IO uint16_t CTLR2;
  uint16_t RESERVED4;
  __IO uint16_t CTLR3;
  uint16_t RESERVED5;
  __IO uint16_t GPR;
  uint16_t RESERVED6;
  __IO uint16_t CTLR4;
  uint16_t RESERVED7;
} USART_TypeDef;

/* Window WatchDog */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t CFGR;
  __IO uint32_t STATR;
} WWDG_TypeDef;

/* OPA Registers */
typedef struct
{
  __IO uint32_t CTLR1;
  __IO uint32_t CTLR2;
  __IO uint32_t CTLR3;
  __IO uint32_t CMP_CTLR;
  __IO uint32_t CMP_STATR;
} OPA_TypeDef;

/* RNG Registers */
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t SR;
  __IO uint32_t DR;
} RNG_TypeDef;

