betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
    __IO uint32_t UH_TX_CTRL;
    __IO uint32_t UH_RX_CTRL;
    __IO uint32_t UH_TX_DMA;
    __IO uint32_t UH_RX_DMA;
    __IO uint32_t UH_TX_DMA_OFS;
    __IO uint32_t UH_RX_DMA_OFS;
    __IO uint16_t HOST_TX_NUMP;
    __IO uint16_t HOST_RX_NUMP;
    __IO uint32_t HOST_STATUS;
    __IO uint16_t HOST_TX_FC_STATUS;
    __IO uint16_t HOST_RX_FC_STATUS;
    __IO uint32_t TP_RX_DATA0;
    __IO uint32_t TP_RX_DATA1;
    __IO uint32_t TP_RX_DATA2;
}USBSSH_TypeDef;

// /* USBHS Deveice Registers */
// typedef struct
// {
//   __IO uint8_t  CONTROL;
//   __IO uint8_t  BASE_MODE;
//   __IO uint8_t  INT_EN;
//   __IO uint8_t  DEV_AD;
//   __IO uint8_t  WAKE_CTRL;
//   __IO uint8_t  TEST_MODE;
//   __IO uint16_t LPM_DATA;

//   __IO uint8_t  INT_FG;
//   __IO uint8_t  INT_ST;
//   __IO uint8_t  MIS_ST;
//   uint8_t  RESERVED0;

//   __IO uint16_t FRAME_NO;
//   __IO uint16_t BUS;

//   __IO uint16_t UEP_TX_EN;
//   __IO uint16_t UEP_RX_EN;
//   __IO uint16_t UEP_TX_TOG_AUTO;
//   __IO uint16_t UEP_RX_TOG_AUTO;

//   __IO uint8_t  UEP_TX_BURST;
//   __IO uint8_t  UEP_TX_BURST_MODE;
//   __IO uint8_t  UEP_RX_BURST;
//   __IO uint8_t  UEP_RX_RES_MODE;

//   __IO uint32_t UEP_AF_MODE;
//   __IO uint32_t UEP0_DMA;
//   __IO uint32_t UEP1_RX_DMA;
//   __IO uint32_t UEP2_RX_DMA;
//   __IO uint32_t UEP3_RX_DMA;
//   __IO uint32_t UEP4_RX_DMA;
//   __IO uint32_t UEP5_RX_DMA;
//   __IO uint32_t UEP6_RX_DMA;
//   __IO uint32_t UEP7_RX_DMA;
//   __IO uint32_t UEP1_TX_DMA;
//   __IO uint32_t UEP2_TX_DMA;
//   __IO uint32_t UEP3_TX_DMA;
//   __IO uint32_t UEP4_TX_DMA;
//   __IO uint32_t UEP5_TX_DMA;
//   __IO uint32_t UEP6_TX_DMA;
//   __IO uint32_t UEP7_TX_DMA;
//   __IO uint32_t UEP0_MAX_LEN;
//   __IO uint32_t UEP1_MAX_LEN;
//   __IO uint32_t UEP2_MAX_LEN;
//   __IO uint32_t UEP3_MAX_LEN;
//   __IO uint32_t UEP4_MAX_LEN;
//   __IO uint32_t UEP5_MAX_LEN;
//   __IO uint32_t UEP6_MAX_LEN;
//   __IO uint32_t UEP7_MAX_LEN;

//   __IO uint16_t UEP0_RX_LEN;
//   uint16_t RESERVED1;
//   __IO uint16_t UEP1_RX_LEN;
//   __IO uint16_t UEP1_RX_SIZE;
//   __IO uint16_t UEP2_RX_LEN;
//   __IO uint16_t UEP2_RX_SIZE;
//   __IO uint16_t UEP3_RX_LEN;
//   __IO uint16_t UEP3_RX_SIZE;
//   __IO uint16_t UEP4_RX_LEN;
//   __IO uint16_t UEP4_RX_SIZE;
//   __IO uint16_t UEP5_RX_LEN;
//   __IO uint16_t UEP5_RX_SIZE;
//   __IO uint16_t UEP6_RX_LEN;
//   __IO uint16_t UEP6_RX_SIZE;
//   __IO uint16_t UEP7_RX_LEN;
//   __IO uint16_t UEP7_RX_SIZE;
//   __IO uint16_t UEP0_TX_LEN;
//   __IO uint8_t  UEP0_TX_CTRL;
//   __IO uint8_t  UEP0_RX_CTRL;

//   __IO uint16_t UEP1_TX_LEN;
//   __IO uint8_t  UEP1_TX_CTRL;
//   __IO uint8_t  UEP1_RX_CTRL;
//   __IO uint16_t UEP2_TX_LEN;
//   __IO uint8_t  UEP2_TX_CTRL;
//   __IO uint8_t  UEP2_RX_CTRL;
//   __IO uint16_t UEP3_TX_LEN;
//   __IO uint8_t  UEP3_TX_CTRL;
//   __IO uint8_t  UEP3_RX_CTRL;
//   __IO uint16_t UEP4_TX_LEN;
//   __IO uint8_t  UEP4_TX_CTRL;
//   __IO uint8_t  UEP4_RX_CTRL;
//   __IO uint16_t UEP5_TX_LEN;
//   __IO uint8_t  UEP5_TX_CTRL;
//   __IO uint8_t  UEP5_RX_CTRL;
//   __IO uint16_t UEP6_TX_LEN;
//   __IO uint8_t  UEP6_TX_CTRL;
//   __IO uint8_t  UEP6_RX_CTRL;
//   __IO uint16_t UEP7_TX_LEN;
//   __IO uint8_t  UEP7_TX_CTRL;
//   __IO uint8_t  UEP7_RX_CTRL;

//   __IO uint16_t UEP_TX_ISO;
//   __IO uint16_t UEP_RX_ISO;

//   __IO uint32_t UEP1_RX_FIFO;
//   __IO uint32_t UEP2_RX_FIFO;
//   __IO uint32_t UEP3_RX_FIFO;
//   __IO uint32_t UEP4_RX_FIFO;
//   __IO uint32_t UEP5_RX_FIFO;
//   __IO uint32_t UEP6_RX_FIFO;
//   __IO uint32_t UEP7_RX_FIFO;
//   __IO uint32_t UEP1_TX_FIFO;
//   __IO uint32_t UEP2_TX_FIFO;
//   __IO uint32_t UEP3_TX_FIFO;
//   __IO uint32_t UEP4_TX_FIFO;
//   __IO uint32_t UEP5_TX_FIFO;
//   __IO uint32_t UEP6_TX_FIFO;
//   __IO uint32_t UEP7_TX_FIFO;
// } USBHSD_TypeDef;

// /* USBHS Host Registers */
// typedef struct  __attribute__((packed))
// {
//   __IO uint8_t  CFG;
//   uint8_t  RESERVED0;
//   __IO uint8_t  INT_EN;
//   __IO uint8_t  DEV_ADDR;
//   __IO uint32_t CONTROL;

//   __IO uint8_t  INT_FLAG;
//   __IO uint8_t  INT_ST;
//   __IO uint8_t  MIS_ST;
//   uint8_t  RESERVED1;

//   __IO uint32_t LPM;
//   __IO uint32_t SPLIT;
//   __IO uint32_t FRAME;
//   __IO uint32_t TX_LEN;
//   __IO uint32_t RX_LEN;
//   __IO uint32_t RX_MAX_LEN;
//   __IO uint32_t RX_DMA;
//   __IO uint32_t TX_DMA;
//   __IO uint32_t PORT_CTRL;
//   __IO uint8_t  PORT_CFG;
//   uint8_t  RESERVED2;
//   __IO uint8_t  PORT_INT_EN;
//   __IO uint8_t  PORT_TEST_CT;

//   __IO uint16_t PORT_STATUS;
//   __IO uint8_t  PORT_STATUS_CHG;
//   uint8_t  RESERVED3[5];
//   __IO uint32_t ROOT_BC_CTRL;
// } USBHSH_TypeDef;

/* USBFS Device Registers */
typedef struct
{
   __IO uint8_t  BASE_CTRL;
   __IO uint8_t  UDEV_CTRL;
   __IO uint8_t  INT_EN;
   __IO uint8_t  DEV_ADDR;
   uint8_t  RESERVED0;
   __IO uint8_t  MIS_ST;
   __IO uint8_t  INT_FG;
   __IO uint8_t  INT_ST;
   __IO uint16_t RX_LEN;

   uint16_t RESERVED1;
   __IO uint8_t  UEP4_1_MOD;
   __IO uint8_t  UEP2_3_MOD;
   __IO uint8_t  UEP5_6_MOD;
   __IO uint8_t  UEP7_MOD;
   __IO uint32_t UEP0_DMA;
   __IO uint32_t UEP1_DMA;
   __IO uint32_t UEP2_DMA;
   __IO uint32_t UEP3_DMA;
   __IO uint32_t UEP4_DMA;
   __IO uint32_t UEP5_DMA;
   __IO uint32_t UEP6_DMA;
   __IO uint32_t UEP7_DMA;
   __IO uint8_t  UEP0_TX_LEN;
   uint8_t  RESERVED2;
   __IO uint8_t  UEP0_TX_CTRL;
   __IO uint8_t  UEP0_RX_CTRL;
   __IO uint8_t  UEP1_TX_LEN;
   uint8_t  RESERVED3;
   __IO uint8_t  UEP1_TX_CTRL;
   __IO uint8_t  UEP1_RX_CTRL;
   __IO uint8_t  UEP2_TX_LEN;
   uint8_t  RESERVED4;
   __IO uint8_t  UEP2_TX_CTRL;
   __IO uint8_t  UEP2_RX_CTRL;
   __IO uint16_t UEP3_TX_LEN;
   __IO uint8_t  UEP3_TX_CTRL;
   __IO uint8_t  UEP3_RX_CTRL;
   __IO uint8_t  UEP4_TX_LEN;
   uint8_t  RESERVED5;
   __IO uint8_t  UEP4_TX_CTRL;
   __IO uint8_t  UEP4_RX_CTRL;
   __IO uint8_t  UEP5_TX_LEN;
   uint8_t  RESERVED6;
   __IO uint8_t  UEP5_TX_CTRL;
   __IO uint8_t  UEP5_RX_CTRL;
   __IO uint8_t  UEP6_TX_LEN;
   uint8_t  RESERVED7;
   __IO uint8_t  UEP6_TX_CTRL;
   __IO uint8_t  UEP6_RX_CTRL;
   __IO uint8_t  UEP7_TX_LEN;
   uint8_t  RESERVED8;
   __IO uint8_t  UEP7_TX_CTRL;
   __IO uint8_t  UEP7_RX_CTRL;
   uint32_t RESERVED9;
   __IO uint32_t OTG_CR;
   __IO uint32_t OTG_SR;
}USBFSD_TypeDef;

