betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/* USBFS Host Registers */
typedef struct  __attribute__((packed))
{
   __IO uint8_t   BASE_CTRL;
   __IO uint8_t   HOST_CTRL;
   __IO uint8_t   INT_EN;
   __IO uint8_t   DEV_ADDR;
   uint8_t   RESERVED0;
   __IO uint8_t   MIS_ST;
   __IO uint8_t   INT_FG;
   __IO uint8_t   INT_ST;
   __IO uint16_t  RX_LEN;

   uint16_t  RESERVED1;
   uint8_t   RESERVED2;
   __IO uint8_t   HOST_EP_MOD;
   uint16_t  RESERVED3;
   uint32_t  RESERVED4;
   uint32_t  RESERVED5;
   __IO uint32_t  HOST_RX_DMA;
   __IO uint32_t  HOST_TX_DMA;
   uint32_t  RESERVED6;
   uint32_t  RESERVED7;
   uint32_t  RESERVED8;
   uint32_t  RESERVED9;
   uint32_t  RESERVED10;
   uint16_t  RESERVED11;
   __IO uint16_t  HOST_SETUP;
   __IO uint8_t   HOST_EP_PID;
   uint8_t   RESERVED12;
   uint8_t   RESERVED13;
   __IO uint8_t   HOST_RX_CTRL;
   __IO uint16_t  HOST_TX_LEN;
   __IO uint8_t   HOST_TX_CTRL;
   uint8_t   RESERVED14;
   uint32_t  RESERVED15;
   uint32_t  RESERVED16;
   uint32_t  RESERVED17;
   uint32_t  RESERVED18;
   uint32_t  RESERVED19;
   __IO uint32_t  OTG_CR;
   __IO uint32_t  OTG_SR;
}USBFSH_TypeDef;

/* Ethernet MAC Registers */
typedef struct
{
  __IO uint32_t MACCR;
  __IO uint32_t MACFFR;
  __IO uint32_t MACHTHR;
  __IO uint32_t MACHTLR;
  __IO uint32_t MACMIIAR;
  __IO uint32_t MACMIIDR;
  __IO uint32_t MACFCR;
  __IO uint32_t MACVLANTR;
  uint32_t RESERVED0[2];
  __IO uint32_t MACRWUFFR;
  __IO uint32_t MACPMTCSR;
  uint32_t RESERVED1[2];
  __IO uint32_t MACSR;
  __IO uint32_t MACIMR;
  __IO uint32_t MACA0HR;
  __IO uint32_t MACA0LR;
  __IO uint32_t MACA1HR;
  __IO uint32_t MACA1LR;
  __IO uint32_t MACA2HR;
  __IO uint32_t MACA2LR;
  __IO uint32_t MACA3HR;
  __IO uint32_t MACA3LR;
  uint32_t RESERVED2[14];
  __IO uint32_t MACCFG0;
  uint32_t RESERVED10[25];
  __IO uint32_t MMCCR;
  __IO uint32_t MMCRIR;
  __IO uint32_t MMCTIR;
  __IO uint32_t MMCRIMR;
  __IO uint32_t MMCTIMR;
  uint32_t RESERVED3[14];
  __IO uint32_t MMCTGFSCCR;
  __IO uint32_t MMCTGFMSCCR;
  uint32_t RESERVED4[5];
  __IO uint32_t MMCTGFCR;
  uint32_t RESERVED5[10];
  __IO uint32_t MMCRFCECR;
  __IO uint32_t MMCRFAECR;
  uint32_t RESERVED6[10];
  __IO uint32_t MMCRGUFCR;
  uint32_t RESERVED7[334];
  __IO uint32_t PTPTSCR;
  __IO uint32_t PTPSSIR;
  __IO uint32_t PTPTSHR;
  __IO uint32_t PTPTSLR;
  __IO uint32_t PTPTSHUR;
  __IO uint32_t PTPTSLUR;
  __IO uint32_t PTPTSAR;
  __IO uint32_t PTPTTHR;
  __IO uint32_t PTPTTLR;
  uint32_t RESERVED8[567];
  __IO uint32_t DMABMR;
  __IO uint32_t DMATPDR;
  __IO uint32_t DMARPDR;
  __IO uint32_t DMARDLAR;
  __IO uint32_t DMATDLAR;
  __IO uint32_t DMASR;
  __IO uint32_t DMAOMR;
  __IO uint32_t DMAIER;
  __IO uint32_t DMAMFBOCR;
  uint32_t RESERVED9[9];
  __IO uint32_t DMACHTDR;
  __IO uint32_t DMACHRDR;
  __IO uint32_t DMACHTBAR;
  __IO uint32_t DMACHRBAR;
} ETH_TypeDef;

/* SDMMC Registers */
typedef struct
{
  __IO uint32_t ARGUMENT;
  __IO uint16_t CMD_SET;
  uint16_t RESERVED0;
  __IO uint32_t RESPONSE0;
  __IO uint32_t RESPONSE1;
  __IO uint32_t RESPONSE2;
  union
  {
      __IO uint32_t RESPONSE3;
      __IO uint32_t WRITE_CONT;
  };
  __IO uint16_t CONTROL;
  uint16_t RESERVED1;
  __IO uint8_t TIMEOUT;
  uint8_t RESERVED3[3];
  __IO uint32_t STATUS;
  __IO uint16_t INT_FG;
  uint16_t RESERVED4;
  __IO uint16_t INT_EN;
  uint16_t RESERVED5;
  __IO uint32_t DMA_BEG1;
  __IO uint32_t BLOCK_CFG;
  __IO uint32_t TRAN_MODE;
  __IO uint16_t CLK_DIV;
  uint16_t RESERVED6;
  __IO uint32_t DMA_BEG2;
  __IO uint32_t TUNE_DATO;
  __IO uint32_t TUNE_DATI;
  __IO uint32_t TUNE_CLK_CMD;
} SDMMC_TypeDef;

/* SAI Registers */
typedef struct
{
    __IO uint32_t CFGR1;
    __IO uint32_t CFGR2;
    __IO uint32_t FRCR;
    __IO uint32_t SLOTR;
    __IO uint32_t INTENR;
    __IO uint32_t SR;
    uint32_t RESERVED0;
    __IO uint32_t DATAR;
} SAI_Block_TypeDef;

/* QSPI Registers */
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t DCR;
  __IO uint32_t SR;
  __IO uint32_t FCR;
  __IO uint32_t DLR;
  __IO uint32_t CCR;
  __IO uint32_t AR;
  __IO uint32_t ABR;
  __IO uint32_t DR;
  __IO uint32_t PSMKR;
  __IO uint32_t PSMAR;
  __IO uint32_t PIR;
  __IO uint32_t LPTR;
} QSPI_TypeDef;

/* SWPMI Registers */
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t BRR;
  uint32_t RESERVED0;
  __IO uint32_t ISR;
  __IO uint32_t ICR;
  __IO uint32_t IER;
  __IO uint32_t RFL;
  __IO uint32_t TDR;
  __IO uint32_t RDR;
  __IO uint32_t OR;
} SWPMI_TypeDef;

/* ECDC Registers */
typedef struct
{
  __IO uint32_t CTRL;
  __IO uint32_t INT_FG;
  __IO uint32_t KEY_255T224;
  __IO uint32_t KEY_223T192;
  __IO uint32_t KEY_191T160;
  __IO uint32_t KEY_159T128;
  __IO uint32_t KEY_127T96;
  __IO uint32_t KEY_95T64;
  __IO uint32_t KEY_63T32;
  __IO uint32_t KEY_31T0;
  __IO uint32_t IV_127T96;
  __IO uint32_t IV_95T64;
  __IO uint32_t IV_63T32;
  __IO uint32_t IV_31T0;
  uint32_t RESERVED3[2];
  __IO uint32_t SGSD_127T96;
  __IO uint32_t SGSD_95T64;
  __IO uint32_t SGSD_63T32;
  __IO uint32_t SGSD_31T0;
  __IO uint32_t SGRT_127T96;
  __IO uint32_t SGRT_95T64;
  __IO uint32_t SGRT_63T32;
  __IO uint32_t SGRT_31T0;
  __IO uint32_t SRC_ADDR;
  __IO uint32_t DST_ADDR;
  __IO uint32_t SRAM_LEN;
} ECDC_TypeDef;

/* DFSDM filter Registers */
typedef struct
{
  __IO uint32_t CR1;
  uint32_t RESERVED0;
  __IO uint32_t CR2;
  uint32_t RESERVED1;
  __IO uint32_t ISR;
  uint32_t RESERVED2;
  __IO uint32_t ICR;
  uint32_t RESERVED3;
  __IO uint32_t JCHGR;
  uint32_t RESERVED4;
  __IO uint32_t FCR3;
  uint32_t RESERVED5;
  __IO uint32_t JDATAR;
  uint32_t RESERVED6;
  __IO uint32_t RDATAR;
  uint32_t RESERVED7;
  __IO uint32_t AWHTR;
  uint32_t RESERVED8;
  __IO uint32_t AWLTR;
  uint32_t RESERVED9;
  __IO uint32_t AWSR;
  uint32_t RESERVED10;
  __IO uint32_t AWCFR;
  uint32_t RESERVED11;
  __IO uint32_t EXMAX;
  uint32_t RESERVED12;
  __IO uint32_t EXMIN;
  uint32_t RESERVED13;
  __IO uint32_t NVTIMR;
  uint32_t RESERVED14;
} DFSDM_FLT_TypeDef;

/* DFSDM channel Registers */
typedef struct
{
  __IO uint32_t CFGR1;
  uint32_t RESERVED0;
  __IO uint32_t CFGR2;
  uint32_t RESERVED1;
  __IO uint32_t AWSCDR;
  uint32_t RESERVED2;
  __IO uint32_t WDATR;
  uint32_t RESERVED3;
  union{
    __IO uint32_t DATINR;
    struct{
       __IO int16_t DATINR0;
       __IO int16_t DATINR1;
    };
  };
} DFSDM_Channel_TypeDef;

/* LTDC Registers */
typedef struct
{
  __IO uint32_t SSCR;
  __IO uint32_t BPCR;
  __IO uint32_t AWCR;
  __IO uint32_t TWCR;
  __IO uint32_t GCR;
  __IO uint32_t SRCR;
  __IO uint32_t BCCR;
  __IO uint32_t IER;
  __IO uint32_t ISR;
  __IO uint32_t ICR;
  __IO uint32_t LIPCR;
  __IO uint32_t CPSR;
  __IO uint32_t CDSR;
} LTDC_TypeDef;

