betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/* LTDC Layer Registers */
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t WHPCR;
  __IO uint32_t WVPCR;
  __IO uint32_t CKCR;
  __IO uint32_t PFCR;
  __IO uint32_t CACR;
  __IO uint32_t DCCR;
  __IO uint32_t BFCR;
  __IO uint32_t CFBAR;
  __IO uint32_t CFBLR;
  __IO uint32_t CFBLNR;
  __IO uint32_t CLUTWR;
} LTDC_Layer_TypeDef;

/* GPHA Registers */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t ISR;
  __IO uint32_t IFCR;
  __IO uint32_t FGMAR;
  __IO uint32_t FGOR;
  __IO uint32_t BGMAR;
  __IO uint32_t BGOR;
  __IO uint32_t FGPFCCR;
  __IO uint32_t FGCOLR;
  __IO uint32_t BGPFCCR;
  __IO uint32_t BGCOLR;
  __IO uint32_t FGCMAR;
  __IO uint32_t BGCMAR;
  __IO uint32_t OPFCCR;
  __IO uint32_t OCOLR;
  __IO uint32_t OMAR;
  __IO uint32_t OOR;
  __IO uint32_t NLR;
  __IO uint32_t LWR;
  __IO uint32_t AMTCR;
  __IO uint32_t FGCWRS;
  __IO uint32_t FGCDAT;
  __IO uint32_t BGCWRS;
  __IO uint32_t BGCDAT;
} GPHA_TypeDef;

/* HSADC Registers */
typedef struct
{
  __IO uint32_t CFGR;
  __IO uint32_t CTLR1;
  __IO uint32_t CTLR2;
  __IO uint32_t STATR;
  __IO uint32_t DATAR;
  __IO uint32_t ADDR0;
  __IO uint32_t ADDR1;
} HSADC_TypeDef;

/* SerDes Registers */
typedef struct
{
  __IO uint32_t CTRL;
  __IO uint32_t INT_EN;
  __IO uint32_t STATUS;
  __IO uint32_t RTX_CTRL;
  __IO uint32_t RX_LEN0;
  __IO uint32_t DATA0;
  __IO uint32_t DMA_0;
  __IO uint32_t RX_LEN1;
  __IO uint32_t DATA1;
  __IO uint32_t DMA_1;
} SDS_TypeDef;

/* Peripheral memory map */
#define FLASH_BASE            ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define ITCM_BASE             ((uint32_t)0x200A0000) /* ITCM base address in the alias region */
#define DTCM_BASE             ((uint32_t)0x200C0000) /* DTCM base address in the alias region */
#define SRAM_BASE             ((uint32_t)0x20100000) /* SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

#define HBPERIPH_BASE         (PERIPH_BASE)

#define TIM2_BASE             (HBPERIPH_BASE + 0x00000)
#define TIM3_BASE             (HBPERIPH_BASE + 0x00400)
#define TIM4_BASE             (HBPERIPH_BASE + 0x00800)
#define TIM5_BASE             (HBPERIPH_BASE + 0x00C00)
#define TIM6_BASE             (HBPERIPH_BASE + 0x01000)
#define TIM7_BASE             (HBPERIPH_BASE + 0x01400)
#define USART6_BASE           (HBPERIPH_BASE + 0x01800)
#define USART7_BASE           (HBPERIPH_BASE + 0x01C00)
#define USART8_BASE           (HBPERIPH_BASE + 0x02000)
#define LPTIM1_BASE           (HBPERIPH_BASE + 0x02400)
#define RTC_BASE              (HBPERIPH_BASE + 0x02800)
#define WWDG_BASE             (HBPERIPH_BASE + 0x02C00)
#define IWDG_BASE             (HBPERIPH_BASE + 0x03000)
#define LPTIM2_BASE           (HBPERIPH_BASE + 0x03400)
#define SPI2_BASE             (HBPERIPH_BASE + 0x03800)
#define SPI3_BASE             (HBPERIPH_BASE + 0x03C00)
#define SPI4_BASE             (HBPERIPH_BASE + 0x04000)
#define USART2_BASE           (HBPERIPH_BASE + 0x04400)
#define USART3_BASE           (HBPERIPH_BASE + 0x04800)
#define USART4_BASE           (HBPERIPH_BASE + 0x04C00)
#define USART5_BASE           (HBPERIPH_BASE + 0x05000)
#define I2C1_BASE             (HBPERIPH_BASE + 0x05400)
#define I2C2_BASE             (HBPERIPH_BASE + 0x05800)
#define I2C3_BASE             (HBPERIPH_BASE + 0x05C00)
#define CAN1_BASE             (HBPERIPH_BASE + 0x06400)
#define CAN2_BASE             (HBPERIPH_BASE + 0x06800)
#define PWR_BASE              (HBPERIPH_BASE + 0x07000)
#define DAC_BASE              (HBPERIPH_BASE + 0x07400)
#define CAN3_BASE             (HBPERIPH_BASE + 0x07800)
#define SWPMI_BASE            (HBPERIPH_BASE + 0x08400)

#define AFIO_BASE             (HBPERIPH_BASE + 0x10000)
#define EXTI_BASE             (HBPERIPH_BASE + 0x10400)
#define GPIOA_BASE            (HBPERIPH_BASE + 0x10800)
#define GPIOB_BASE            (HBPERIPH_BASE + 0x10C00)
#define GPIOC_BASE            (HBPERIPH_BASE + 0x11000)
#define GPIOD_BASE            (HBPERIPH_BASE + 0x11400)
#define GPIOE_BASE            (HBPERIPH_BASE + 0x11800)
#define GPIOF_BASE            (HBPERIPH_BASE + 0x11C00)
#define ADC1_BASE             (HBPERIPH_BASE + 0x12400)
#define ADC2_BASE             (HBPERIPH_BASE + 0x12800)
#define TIM1_BASE             (HBPERIPH_BASE + 0x12C00)
#define SPI1_BASE             (HBPERIPH_BASE + 0x13000)
#define TIM8_BASE             (HBPERIPH_BASE + 0x13400)
#define USART1_BASE           (HBPERIPH_BASE + 0x13800)
#define TIM12_BASE            (HBPERIPH_BASE + 0x13C00)
#define I2C4_BASE             (HBPERIPH_BASE + 0x14000)
#define I3C_BASE              (HBPERIPH_BASE + 0x14400)

#define LTDC_BASE             (HBPERIPH_BASE + 0x14800)
#define LTDC_L1_BASE          (HBPERIPH_BASE + 0x14834)
#define LTDC_L2_BASE          (HBPERIPH_BASE + 0x14864)

#define TIM9_BASE             (HBPERIPH_BASE + 0x14C00)
#define TIM10_BASE            (HBPERIPH_BASE + 0x15000)
#define TIM11_BASE            (HBPERIPH_BASE + 0x15400)

#define SAI_BASE              (HBPERIPH_BASE + 0x15800)
#define SAI_Block_A_BASE      (SAI_BASE + 0x04)
#define SAI_Block_B_BASE      (SAI_BASE + 0x24)

#define GPHA_BASE             (HBPERIPH_BASE + 0x16800)
#define ECDC_BASE             (HBPERIPH_BASE + 0x16C00)

#define DFSDM_BASE            (HBPERIPH_BASE + 0x17000)
#define DFSDM_Channel0_BASE   (HBPERIPH_BASE + 0x17000)
#define DFSDM_Channel1_BASE   (HBPERIPH_BASE + 0x17004)
#define DFSDM_FLT0_BASE       (HBPERIPH_BASE + 0x17028)
#define DFSDM_FLT1_BASE       (HBPERIPH_BASE + 0x1702C)

#define HSADC_BASE            (HBPERIPH_BASE + 0x17400)
#define OPA_BASE              (HBPERIPH_BASE + 0x17800)
#define SDIO_BASE             (HBPERIPH_BASE + 0x18000)

#define DMA1_BASE             (HBPERIPH_BASE + 0x20000)
#define DMA1_Channel1_BASE    (HBPERIPH_BASE + 0x20008)
#define DMA1_Channel2_BASE    (HBPERIPH_BASE + 0x2001C)
#define DMA1_Channel3_BASE    (HBPERIPH_BASE + 0x20030)
#define DMA1_Channel4_BASE    (HBPERIPH_BASE + 0x20044)
#define DMA1_Channel5_BASE    (HBPERIPH_BASE + 0x20058)
#define DMA1_Channel6_BASE    (HBPERIPH_BASE + 0x2006C)
#define DMA1_Channel7_BASE    (HBPERIPH_BASE + 0x20080)
#define DMA1_Channel8_BASE    (HBPERIPH_BASE + 0x20094)

#define DMA2_BASE             (HBPERIPH_BASE + 0x20400)
#define DMA2_Channel1_BASE    (HBPERIPH_BASE + 0x20408)
#define DMA2_Channel2_BASE    (HBPERIPH_BASE + 0x2041C)
#define DMA2_Channel3_BASE    (HBPERIPH_BASE + 0x20430)
#define DMA2_Channel4_BASE    (HBPERIPH_BASE + 0x20444)
#define DMA2_Channel5_BASE    (HBPERIPH_BASE + 0x20458)
#define DMA2_Channel6_BASE    (HBPERIPH_BASE + 0x2046C)
#define DMA2_Channel7_BASE    (HBPERIPH_BASE + 0x20480)
#define DMA2_Channel8_BASE    (HBPERIPH_BASE + 0x20494)

#define DMAMUX_BASE           (HBPERIPH_BASE + 0x20800)
#define RCC_BASE              (HBPERIPH_BASE + 0x21000)
#define FLASH_R_BASE          (HBPERIPH_BASE + 0x22000)
#define CRC_BASE              (HBPERIPH_BASE + 0x23000)
#define USBFS_BASE            (HBPERIPH_BASE + 0x23400)
#define RNG_BASE              (HBPERIPH_BASE + 0x23C00)
#define SDMMC_BASE            (HBPERIPH_BASE + 0x24000)
#define USBPD_BASE            (HBPERIPH_BASE + 0x24400)
#define QSPI1_BASE            (HBPERIPH_BASE + 0x24C00)
#define QSPI2_BASE            (HBPERIPH_BASE + 0x25000)
#define FMC_R_BASE            (HBPERIPH_BASE + 0x25400)
#define FMC_Bank1_R_BASE      (FMC_R_BASE + 0x0000)
#define FMC_Bank1E_R_BASE     (FMC_R_BASE + 0x0104)
#define FMC_Bank3_R_BASE      (FMC_R_BASE + 0x0080)
#define FMC_Bank5_6_R_BASE    (FMC_R_BASE + 0x0140)

#define DVP_BASE              (HBPERIPH_BASE + 0x25800)
#define PIOC_BASE             (HBPERIPH_BASE + 0x25C00)

#define SERDES_BASE           (HBPERIPH_BASE + 0x27C00)
#define SERDES1_BASE          (SERDES_BASE)
#define SERDES2_BASE          (SERDES_BASE+0x0040)

#define ETH_BASE              (HBPERIPH_BASE + 0x28000)
#define ETH_MAC_BASE          (ETH_BASE)
#define ETH_MMC_BASE          (ETH_BASE + 0x0100)
#define ETH_PTP_BASE          (ETH_BASE + 0x0700)
#define ETH_DMA_BASE          (ETH_BASE + 0x1000)

#define USBHS_BASE            (HBPERIPH_BASE + 0x30000)
#define USBHSD_BASE           (USBHS_BASE)
#define USBHSH_BASE           (USBHS_BASE + 0x100)

#define USBSS_BASE            (HBPERIPH_BASE + 0x34000)
#define UHSIF_BASE            (HBPERIPH_BASE + 0x38000)

#define OB_BASE               ((uint32_t)0x1FFFF800)

#define FLASH_CFGR0_BASE      ((uint32_t)0x4002202C)
#define SYS_CFGR0_BASE        ((uint32_t)0x5003C000)  

