betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/* Peripheral declaration */
#define TIM2                  ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                  ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                  ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                  ((TIM_TypeDef *) TIM5_BASE)
#define TIM6                  ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                  ((TIM_TypeDef *) TIM7_BASE)
#define USART6                ((USART_TypeDef *) USART6_BASE)
#define USART7                ((USART_TypeDef *) USART7_BASE)
#define USART8                ((USART_TypeDef *) USART8_BASE)
#define LPTIM1                ((LPTIM_TypeDef *) LPTIM1_BASE)

#define RTC                   ((RTC_TypeDef *) RTC_BASE)
#define WWDG                  ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                  ((IWDG_TypeDef *) IWDG_BASE)
#define LPTIM2                ((LPTIM_TypeDef *) LPTIM2_BASE)
#define SPI2                  ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                  ((SPI_TypeDef *) SPI3_BASE)
#define SPI4                  ((SPI_TypeDef *) SPI4_BASE)
#define USART2                ((USART_TypeDef *) USART2_BASE)
#define USART3                ((USART_TypeDef *) USART3_BASE)
#define USART4                ((USART_TypeDef *) USART4_BASE)
#define USART5                ((USART_TypeDef *) USART5_BASE)
#define I2C1                  ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                  ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                  ((I2C_TypeDef *) I2C3_BASE)
#define CAN1                  ((CAN_TypeDef *) CAN1_BASE)
#define CAN2                  ((CAN_TypeDef *) CAN2_BASE)
#define PWR                   ((PWR_TypeDef *) PWR_BASE)
#define DAC                   ((DAC_TypeDef *) DAC_BASE)
#define CAN3                  ((CAN_TypeDef *) CAN3_BASE)
#define SWPMI                 ((SWPMI_TypeDef *) SWPMI_BASE)

#define AFIO                  ((AFIO_TypeDef *) AFIO_BASE)
#define EXTI                  ((EXTI_TypeDef *) EXTI_BASE)
#define GPIOA                 ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB                 ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC                 ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD                 ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE                 ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF                 ((GPIO_TypeDef *) GPIOF_BASE)
#define ADC1                  ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                  ((ADC_TypeDef *) ADC2_BASE)
#define TKey1                 ((ADC_TypeDef *) ADC1_BASE)
#define TKey2                 ((ADC_TypeDef *) ADC2_BASE)
#define TIM1                  ((TIM_TypeDef *) TIM1_BASE)
#define SPI1                  ((SPI_TypeDef *) SPI1_BASE)
#define TIM8                  ((TIM_TypeDef *) TIM8_BASE)
#define USART1                ((USART_TypeDef *) USART1_BASE)
#define TIM12                 ((TIM_TypeDef *) TIM12_BASE)
#define I2C4                  ((I2C_TypeDef *) I2C4_BASE)
#define I3C                   ((I3C_TypeDef *) I3C_BASE)
#define LTDC                  ((LTDC_TypeDef *) LTDC_BASE)
#define LTDC_Layer1           ((LTDC_Layer_TypeDef *) LTDC_L1_BASE)
#define LTDC_Layer2           ((LTDC_Layer_TypeDef *) LTDC_L2_BASE)
#define TIM9                  ((TIM_TypeDef *) TIM9_BASE)
#define TIM10                 ((TIM_TypeDef *) TIM10_BASE)
#define TIM11                 ((TIM_TypeDef *) TIM11_BASE)
#define SAI_Block_A           ((SAI_Block_TypeDef *) SAI_Block_A_BASE)
#define SAI_Block_B           ((SAI_Block_TypeDef *) SAI_Block_B_BASE)
#define GPHA                  ((GPHA_TypeDef *) GPHA_BASE)
#define ECDC                  ((ECDC_TypeDef *) ECDC_BASE)
#define DFSDM_FLT0            ((DFSDM_FLT_TypeDef *) DFSDM_FLT0_BASE)
#define DFSDM_FLT1            ((DFSDM_FLT_TypeDef *) DFSDM_FLT1_BASE)
#define DFSDM_Channel0        ((DFSDM_Channel_TypeDef *) DFSDM_Channel0_BASE)
#define DFSDM_Channel1        ((DFSDM_Channel_TypeDef *) DFSDM_Channel1_BASE)
#define HSADC                 ((HSADC_TypeDef *) HSADC_BASE)
#define OPA                   ((OPA_TypeDef *) OPA_BASE)
#define SDIO                  ((SDIO_TypeDef *) SDIO_BASE)

#define DMA1                  ((DMA_TypeDef *) DMA1_BASE)
#define DMA2                  ((DMA_TypeDef *) DMA2_BASE)
#define DMA1_Channel1         ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2         ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3         ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4         ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5         ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define DMA1_Channel6         ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE)
#define DMA1_Channel7         ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE)
#define DMA1_Channel8         ((DMA_Channel_TypeDef *) DMA1_Channel8_BASE)
#define DMA2_Channel1         ((DMA_Channel_TypeDef *) DMA2_Channel1_BASE)
#define DMA2_Channel2         ((DMA_Channel_TypeDef *) DMA2_Channel2_BASE)
#define DMA2_Channel3         ((DMA_Channel_TypeDef *) DMA2_Channel3_BASE)
#define DMA2_Channel4         ((DMA_Channel_TypeDef *) DMA2_Channel4_BASE)
#define DMA2_Channel5         ((DMA_Channel_TypeDef *) DMA2_Channel5_BASE)
#define DMA2_Channel6         ((DMA_Channel_TypeDef *) DMA2_Channel6_BASE)
#define DMA2_Channel7         ((DMA_Channel_TypeDef *) DMA2_Channel7_BASE)
#define DMA2_Channel8         ((DMA_Channel_TypeDef *) DMA2_Channel8_BASE)
#define DMAMUX                ((DMAMUX_TypeDef *) DMAMUX_BASE)

#define DMA1MUX_CHANNEL1_BASE            ((DMAMUX_BASE+0))
#define DMA1MUX_CHANNEL2_BASE            ((DMAMUX_BASE+1))
#define DMA1MUX_CHANNEL3_BASE            ((DMAMUX_BASE+2))
#define DMA1MUX_CHANNEL4_BASE            ((DMAMUX_BASE+3))
#define DMA1MUX_CHANNEL5_BASE            ((DMAMUX_BASE+4))
#define DMA1MUX_CHANNEL6_BASE            ((DMAMUX_BASE+5))
#define DMA1MUX_CHANNEL7_BASE            ((DMAMUX_BASE+6))
#define DMA1MUX_CHANNEL8_BASE            ((DMAMUX_BASE+7))
#define DMA2MUX_CHANNEL1_BASE            ((DMAMUX_BASE+8))
#define DMA2MUX_CHANNEL2_BASE            ((DMAMUX_BASE+9))
#define DMA2MUX_CHANNEL3_BASE            ((DMAMUX_BASE+10))
#define DMA2MUX_CHANNEL4_BASE            ((DMAMUX_BASE+11))
#define DMA2MUX_CHANNEL5_BASE            ((DMAMUX_BASE+12))
#define DMA2MUX_CHANNEL6_BASE            ((DMAMUX_BASE+13))
#define DMA2MUX_CHANNEL7_BASE            ((DMAMUX_BASE+14))
#define DMA2MUX_CHANNEL8_BASE            ((DMAMUX_BASE+15))


#define DMA1MUX_CHANNEL1            ((dmamux_channel_type *)DMA1MUX_CHANNEL1_BASE)
#define DMA1MUX_CHANNEL2            ((dmamux_channel_type *)DMA1MUX_CHANNEL2_BASE)
#define DMA1MUX_CHANNEL3            ((dmamux_channel_type *)DMA1MUX_CHANNEL3_BASE)
#define DMA1MUX_CHANNEL4            ((dmamux_channel_type *)DMA1MUX_CHANNEL4_BASE)
#define DMA1MUX_CHANNEL5            ((dmamux_channel_type *)DMA1MUX_CHANNEL5_BASE)
#define DMA1MUX_CHANNEL6            ((dmamux_channel_type *)DMA1MUX_CHANNEL6_BASE)
#define DMA1MUX_CHANNEL7            ((dmamux_channel_type *)DMA1MUX_CHANNEL7_BASE)
#define DMA1MUX_CHANNEL8            ((dmamux_channel_type *)DMA1MUX_CHANNEL8_BASE)

#define DMA2MUX_CHANNEL1            ((dmamux_channel_type *)DMA2MUX_CHANNEL1_BASE)
#define DMA2MUX_CHANNEL2            ((dmamux_channel_type *)DMA2MUX_CHANNEL2_BASE)
#define DMA2MUX_CHANNEL3            ((dmamux_channel_type *)DMA2MUX_CHANNEL3_BASE)
#define DMA2MUX_CHANNEL4            ((dmamux_channel_type *)DMA2MUX_CHANNEL4_BASE)
#define DMA2MUX_CHANNEL5            ((dmamux_channel_type *)DMA2MUX_CHANNEL5_BASE)
#define DMA2MUX_CHANNEL6            ((dmamux_channel_type *)DMA2MUX_CHANNEL6_BASE)
#define DMA2MUX_CHANNEL7            ((dmamux_channel_type *)DMA2MUX_CHANNEL7_BASE)
#define DMA2MUX_CHANNEL8            ((dmamux_channel_type *)DMA2MUX_CHANNEL8_BASE)




#define RCC                   ((RCC_TypeDef *) RCC_BASE)
#define FLASH                 ((FLASH_TypeDef *) FLASH_R_BASE)
#define CRC                   ((CRC_TypeDef *) CRC_BASE)

#define USBFSD                ((USBFSD_TypeDef *)USBFS_BASE)
#define USBFSH                ((USBFSH_TypeDef *)USBFS_BASE)
#define RNG                   ((RNG_TypeDef *) RNG_BASE)
#define SDMMC                 ((SDMMC_TypeDef *) SDMMC_BASE)
#define USBPD                 ((USBPD_TypeDef *) USBPD_BASE)
#define QSPI1                 ((QSPI_TypeDef *) QSPI1_BASE)
#define QSPI2                 ((QSPI_TypeDef *) QSPI2_BASE)
#define FMC_Bank1             ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE)
#define FMC_Bank1E            ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE)
#define FMC_Bank3             ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE)
#define FMC_Bank5_6           ((FMC_Bank5_6_TypeDef *) FMC_Bank5_6_R_BASE)
#define DVP                   ((DVP_TypeDef *) DVP_BASE)
#define ETH                   ((ETH_TypeDef *) ETH_BASE)
#define USBHSD                ((USBHSD_TypeDef *) USBHSD_BASE)
#define USBHSH                ((USBHSH_TypeDef *) USBHSH_BASE)
#define USBSSD                ((USBSSD_TypeDef *) USBSS_BASE)
#define USBSSH                ((USBSSH_TypeDef *) USBSS_BASE)
#define SDS1                  ((SDS_TypeDef *) SERDES1_BASE)
#define SDS2                  ((SDS_TypeDef *) SERDES2_BASE)
#define UHSIF                 ((UHSIF_TypeDef *) UHSIF_BASE)
#define OB                    ((OB_TypeDef *) OB_BASE)

/******************************************************************************/
/*                         Peripheral Registers Bits Definition               */
/******************************************************************************/

/******************************************************************************/
/*                        Analog to Digital Converter                         */
/******************************************************************************/

/********************  Bit definition for ADC_STATR register  ********************/
#define  ADC_AWD                                     ((uint8_t)0x01)               /* Analog watchdog flag */
#define  ADC_EOC                                     ((uint8_t)0x02)               /* End of conversion */
#define  ADC_JEOC                                    ((uint8_t)0x04)               /* Injected channel end of conversion */
#define  ADC_JSTRT                                   ((uint8_t)0x08)               /* Injected channel Start flag */
#define  ADC_STRT                                    ((uint8_t)0x10)               /* Regular channel Start flag */

/*******************  Bit definition for ADC_CTLR1 register  ********************/
#define  ADC_AWDCH                                   ((uint32_t)0x0000001F)        /* AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define  ADC_AWDCH_0                                 ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_AWDCH_1                                 ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_AWDCH_2                                 ((uint32_t)0x00000004)        /* Bit 2 */
#define  ADC_AWDCH_3                                 ((uint32_t)0x00000008)        /* Bit 3 */
#define  ADC_AWDCH_4                                 ((uint32_t)0x00000010)        /* Bit 4 */

#define  ADC_EOCIE                                   ((uint32_t)0x00000020)        /* Interrupt enable for EOC */
#define  ADC_AWDIE                                   ((uint32_t)0x00000040)        /* Analog Watchdog interrupt enable */
#define  ADC_JEOCIE                                  ((uint32_t)0x00000080)        /* Interrupt enable for injected channels */
#define  ADC_SCAN                                    ((uint32_t)0x00000100)        /* Scan mode */
#define  ADC_AWDSGL                                  ((uint32_t)0x00000200)        /* Enable the watchdog on a single channel in scan mode */
#define  ADC_JAUTO                                   ((uint32_t)0x00000400)        /* Automatic injected group conversion */
#define  ADC_DISCEN                                  ((uint32_t)0x00000800)        /* Discontinuous mode on regular channels */
#define  ADC_JDISCEN                                 ((uint32_t)0x00001000)        /* Discontinuous mode on injected channels */

