betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/********************  Bit definition for ADC_DRV register  ********************/
#define  ADC_DRV_TKEY_OUTEN                          ((uint32_t)0x0000FFFF)        /* Touchkey enables multi-channel shielding of each channel */
#define  ADC_DRV_TKEY_EN                             ((uint32_t)0x00010000)        /* Touchkey Multi Channel Shielding Enable */

/******************************************************************************/
/*                       High Speed Analog to Digital Converter                         */
/******************************************************************************/

/********************  Bit definition for HSADC_CFGR register  ********************/
#define  HSADC_EN                                    ((uint32_t)0x00000001)
#define  HSADC_DMAEN                                 ((uint32_t)0x00000002)

#define  HSADC_CHSEL                                 ((uint32_t)0x0000001C)
#define  HSADC_CHSEL_0                               ((uint32_t)0x00000004)
#define  HSADC_CHSEL_1                               ((uint32_t)0x00000008)
#define  HSADC_CHSEL_2                               ((uint32_t)0x00000010)

#define  HSADC_SETUP                                 ((uint32_t)0x00000060)
#define  HSADC_SETUP_0                               ((uint32_t)0x00000020)
#define  HSADC_SETUP_1                               ((uint32_t)0x00000040)

#define  HSADC_WIDTH                                 ((uint32_t)0x00000080)

#define  HSADC_CLKDIV                                ((uint32_t)0x00003F00)
#define  HSADC_CLKDIV_0                              ((uint32_t)0x00000100)
#define  HSADC_CLKDIV_1                              ((uint32_t)0x00000200)
#define  HSADC_CLKDIV_2                              ((uint32_t)0x00000400)
#define  HSADC_CLKDIV_3                              ((uint32_t)0x00000800)
#define  HSADC_CLKDIV_4                              ((uint32_t)0x00001000)
#define  HSADC_CLKDIV_5                              ((uint32_t)0x00002000)

#define  HSADC_PPMODE                                ((uint32_t)0x00004000)
#define  HSADC_BURST_EN                              ((uint32_t)0x00008000)

#define  HSADC_DMA_LEN                               ((uint32_t)0xFFFF0000)

/********************  Bit definition for HSADC_CTLR1 register  ********************/
#define  HSADC_START                                 ((uint32_t)0x00000001)
#define  HSADC_BURSTEND                              ((uint32_t)0x00000002)
#define  HSADC_EOCIE                                 ((uint32_t)0x00000100)
#define  HSADC_DMAIE                                 ((uint32_t)0x00000200)
#define  HSADC_BURSTIE                               ((uint32_t)0x00000400)

/********************  Bit definition for HSADC_CTLR2 register  ********************/
#define  HSADC_BURST_LEN                             ((uint32_t)0x0000FFFF)
#define  HSADC_BURST_DMA_LEN                         ((uint32_t)0xFFFF0000)

/********************  Bit definition for HSADC_STATR register  ********************/
#define  HSADC_EOCIF                                 ((uint32_t)0x00000001)
#define  HSADC_DMAIF                                 ((uint32_t)0x00000002)
#define  HSADC_BURSTIF                               ((uint32_t)0x00000004)
#define  HSADC_RXNE                                  ((uint32_t)0x00000008)
#define  HSADC_PP_ADDR                               ((uint32_t)0x00000010)

#define  HSADC_FIFO_RDY                              ((uint32_t)0x00000100)
#define  HSADC_FIFO_FULL                             ((uint32_t)0x00000200)
#define  HSADC_FIFO_OV                               ((uint32_t)0x00000400)

#define  HSADC_FIFO_CNT                              ((uint32_t)0x00003800)

/********************  Bit definition for HSADC_DATAR register  ********************/
#define  HSADC_DR                                    ((uint32_t)0x000003FF)

/********************  Bit definition for HSADC_ADDR0 register  ********************/
#define  HSADC_DMA_ADDR0                             ((uint32_t)0xFFFFFFFF)

/********************  Bit definition for HSADC_ADDR1 register  ********************/
#define  HSADC_DMA_ADDR1                             ((uint32_t)0xFFFFFFFF)

/******************************************************************************/
/*                         Controller Area Network                            */
/******************************************************************************/

/*******************  Bit definition for CAN_CTLR register  ********************/
#define  CAN_CTLR_INRQ                               ((uint16_t)0x0001)            /* Initialization Request */
#define  CAN_CTLR_SLEEP                              ((uint16_t)0x0002)            /* Sleep Mode Request */
#define  CAN_CTLR_TXFP                               ((uint16_t)0x0004)            /* Transmit FIFO Priority */
#define  CAN_CTLR_RFLM                               ((uint16_t)0x0008)            /* Receive FIFO Locked Mode */
#define  CAN_CTLR_NART                               ((uint16_t)0x0010)            /* No Automatic Retransmission */
#define  CAN_CTLR_AWUM                               ((uint16_t)0x0020)            /* Automatic Wakeup Mode */
#define  CAN_CTLR_ABOM                              ((uint16_t)0x0040)            /* Automatic Bus-Off Management */
#define  CAN_CTLR_TTCM                               ((uint16_t)0x0080)            /* Time Triggered Communication Mode */
#define  CAN_CTLR_RESET                              ((uint16_t)0x8000)            /* CAN software master reset */
#define  CAN_CTLR_DBF                                ((uint32_t)0x10000)
#define  CAN_CTLR_CFGCANM                            ((uint32_t)0x20000)
/*******************  Bit definition for CAN_STATR register  ********************/
#define  CAN_STATR_INAK                              ((uint16_t)0x0001)            /* Initialization Acknowledge */
#define  CAN_STATR_SLAK                              ((uint16_t)0x0002)            /* Sleep Acknowledge */
#define  CAN_STATR_ERRI                              ((uint16_t)0x0004)            /* Error Interrupt */
#define  CAN_STATR_WKUI                              ((uint16_t)0x0008)            /* Wakeup Interrupt */
#define  CAN_STATR_SLAKI                             ((uint16_t)0x0010)            /* Sleep Acknowledge Interrupt */
#define  CAN_STATR_TXM                               ((uint16_t)0x0100)            /* Transmit Mode */
#define  CAN_STATR_RXM                               ((uint16_t)0x0200)            /* Receive Mode */
#define  CAN_STATR_SAMP                              ((uint16_t)0x0400)            /* Last Sample Point */
#define  CAN_STATR_RX                                ((uint16_t)0x0800)            /* CAN Rx Signal */

/*******************  Bit definition for CAN_TSTATR register  ********************/
#define  CAN_TSTATR_RQCP0                            ((uint32_t)0x00000001)        /* Request Completed Mailbox0 */
#define  CAN_TSTATR_TXOK0                            ((uint32_t)0x00000002)        /* Transmission OK of Mailbox0 */
#define  CAN_TSTATR_ALST0                            ((uint32_t)0x00000004)        /* Arbitration Lost for Mailbox0 */
#define  CAN_TSTATR_TERR0                            ((uint32_t)0x00000008)        /* Transmission Error of Mailbox0 */
#define  CAN_TSTATR_ABRQ0                            ((uint32_t)0x00000080)        /* Abort Request for Mailbox0 */
#define  CAN_TSTATR_RQCP1                            ((uint32_t)0x00000100)        /* Request Completed Mailbox1 */
#define  CAN_TSTATR_TXOK1                            ((uint32_t)0x00000200)        /* Transmission OK of Mailbox1 */
#define  CAN_TSTATR_ALST1                            ((uint32_t)0x00000400)        /* Arbitration Lost for Mailbox1 */
#define  CAN_TSTATR_TERR1                            ((uint32_t)0x00000800)        /* Transmission Error of Mailbox1 */
#define  CAN_TSTATR_ABRQ1                            ((uint32_t)0x00008000)        /* Abort Request for Mailbox 1 */
#define  CAN_TSTATR_RQCP2                            ((uint32_t)0x00010000)        /* Request Completed Mailbox2 */
#define  CAN_TSTATR_TXOK2                            ((uint32_t)0x00020000)        /* Transmission OK of Mailbox 2 */
#define  CAN_TSTATR_ALST2                            ((uint32_t)0x00040000)        /* Arbitration Lost for mailbox 2 */
#define  CAN_TSTATR_TERR2                            ((uint32_t)0x00080000)        /* Transmission Error of Mailbox 2 */
#define  CAN_TSTATR_ABRQ2                            ((uint32_t)0x00800000)        /* Abort Request for Mailbox 2 */
#define  CAN_TSTATR_CODE                             ((uint32_t)0x03000000)        /* Mailbox Code */

