betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/******************  Bit definition for DMA_M1ADDR3 register  *******************/
#define  DMA_M1ADDR3_M1A                             ((uint32_t)0xFFFFFFFF)        /* Memory Address */

/******************  Bit definition for DMA_M1ADDR4 register  *******************/
#define  DMA_M1ADDR4_M1A                             ((uint32_t)0xFFFFFFFF)        /* Memory Address */

/******************  Bit definition for DMA_M1ADDR5 register  *******************/
#define  DMA_M1ADDR5_M1A                             ((uint32_t)0xFFFFFFFF)        /* Memory Address */

/******************  Bit definition for DMA_M1ADDR6 register  *******************/
#define  DMA_M1ADDR6_M1A                             ((uint32_t)0xFFFFFFFF)        /* Memory Address */

/******************  Bit definition for DMA_M1ADDR7 register  *******************/
#define  DMA_M1ADDR7_M1A                             ((uint32_t)0xFFFFFFFF)        /* Memory Address */

/******************  Bit definition for DMA_M1ADDR8 register  *******************/
#define  DMA_M1ADDR8_M1A                             ((uint32_t)0xFFFFFFFF)        /* Memory Address */

/******************  Bit definition for DMA_MUX0_3_CFGR register  *******************/
#define  DMA_MUX_CH0                                 ((uint32_t)0x0000007F)
#define  DMA_MUX_CH1                                 ((uint32_t)0x00007F00)
#define  DMA_MUX_CH2                                 ((uint32_t)0x007F0000)
#define  DMA_MUX_CH3                                 ((uint32_t)0x7F000000)

/******************  Bit definition for DMA_MUX4_7_CFGR register  *******************/
#define  DMA_MUX_CH4                                 ((uint32_t)0x0000007F)
#define  DMA_MUX_CH5                                 ((uint32_t)0x00007F00)
#define  DMA_MUX_CH6                                 ((uint32_t)0x007F0000)
#define  DMA_MUX_CH7                                 ((uint32_t)0x7F000000)

/******************  Bit definition for DMA_MUX8_11_CFGR register  *******************/
#define  DMA_MUX_CH8                                 ((uint32_t)0x0000007F)
#define  DMA_MUX_CH9                                 ((uint32_t)0x00007F00)
#define  DMA_MUX_CH10                                ((uint32_t)0x007F0000)
#define  DMA_MUX_CH11                                ((uint32_t)0x7F000000)

/******************  Bit definition for DMA_MUX12_15_CFGR register  *******************/
#define  DMA_MUX_CH12                                ((uint32_t)0x0000007F)
#define  DMA_MUX_CH13                                ((uint32_t)0x00007F00)
#define  DMA_MUX_CH14                                ((uint32_t)0x007F0000)
#define  DMA_MUX_CH15                                ((uint32_t)0x7F000000)

/******************************************************************************/
/*                    External Interrupt/Event Controller                     */
/******************************************************************************/

/*******************  Bit definition for EXTI_INTENR register  *******************/
#define  EXTI_INTENR_MR0                             ((uint32_t)0x00000001)        /* Interrupt Mask on line 0 */
#define  EXTI_INTENR_MR1                             ((uint32_t)0x00000002)        /* Interrupt Mask on line 1 */
#define  EXTI_INTENR_MR2                             ((uint32_t)0x00000004)        /* Interrupt Mask on line 2 */
#define  EXTI_INTENR_MR3                             ((uint32_t)0x00000008)        /* Interrupt Mask on line 3 */
#define  EXTI_INTENR_MR4                             ((uint32_t)0x00000010)        /* Interrupt Mask on line 4 */
#define  EXTI_INTENR_MR5                             ((uint32_t)0x00000020)        /* Interrupt Mask on line 5 */
#define  EXTI_INTENR_MR6                             ((uint32_t)0x00000040)        /* Interrupt Mask on line 6 */
#define  EXTI_INTENR_MR7                             ((uint32_t)0x00000080)        /* Interrupt Mask on line 7 */
#define  EXTI_INTENR_MR8                             ((uint32_t)0x00000100)        /* Interrupt Mask on line 8 */
#define  EXTI_INTENR_MR9                             ((uint32_t)0x00000200)        /* Interrupt Mask on line 9 */
#define  EXTI_INTENR_MR10                            ((uint32_t)0x00000400)        /* Interrupt Mask on line 10 */
#define  EXTI_INTENR_MR11                            ((uint32_t)0x00000800)        /* Interrupt Mask on line 11 */
#define  EXTI_INTENR_MR12                            ((uint32_t)0x00001000)        /* Interrupt Mask on line 12 */
#define  EXTI_INTENR_MR13                            ((uint32_t)0x00002000)        /* Interrupt Mask on line 13 */
#define  EXTI_INTENR_MR14                            ((uint32_t)0x00004000)        /* Interrupt Mask on line 14 */
#define  EXTI_INTENR_MR15                            ((uint32_t)0x00008000)        /* Interrupt Mask on line 15 */
#define  EXTI_INTENR_MR16                            ((uint32_t)0x00010000)        /* Interrupt Mask on line 16 */
#define  EXTI_INTENR_MR17                            ((uint32_t)0x00020000)        /* Interrupt Mask on line 17 */
#define  EXTI_INTENR_MR18                            ((uint32_t)0x00040000)        /* Interrupt Mask on line 18 */
#define  EXTI_INTENR_MR19                            ((uint32_t)0x00080000)        /* Interrupt Mask on line 19 */
#define  EXTI_INTENR_MR20                            ((uint32_t)0x00100000)        /* Interrupt Mask on line 20 */
#define  EXTI_INTENR_MR21                            ((uint32_t)0x00200000)        /* Interrupt Mask on line 21 */
#define  EXTI_INTENR_MR22                            ((uint32_t)0x00400000)        /* Interrupt Mask on line 22 */
#define  EXTI_INTENR_MR23                            ((uint32_t)0x00800000)        /* Interrupt Mask on line 23 */
#define  EXTI_INTENR_MR24                            ((uint32_t)0x01000000)        /* Interrupt Mask on line 24 */
#define  EXTI_INTENR_MR25                            ((uint32_t)0x02000000)        /* Interrupt Mask on line 25 */

/*******************  Bit definition for EXTI_EVENR register  *******************/
#define  EXTI_EVENR_MR0                              ((uint32_t)0x00000001)        /* Event Mask on line 0 */
#define  EXTI_EVENR_MR1                              ((uint32_t)0x00000002)        /* Event Mask on line 1 */
#define  EXTI_EVENR_MR2                              ((uint32_t)0x00000004)        /* Event Mask on line 2 */
#define  EXTI_EVENR_MR3                              ((uint32_t)0x00000008)        /* Event Mask on line 3 */
#define  EXTI_EVENR_MR4                              ((uint32_t)0x00000010)        /* Event Mask on line 4 */
#define  EXTI_EVENR_MR5                              ((uint32_t)0x00000020)        /* Event Mask on line 5 */
#define  EXTI_EVENR_MR6                              ((uint32_t)0x00000040)        /* Event Mask on line 6 */
#define  EXTI_EVENR_MR7                              ((uint32_t)0x00000080)        /* Event Mask on line 7 */
#define  EXTI_EVENR_MR8                              ((uint32_t)0x00000100)        /* Event Mask on line 8 */
#define  EXTI_EVENR_MR9                              ((uint32_t)0x00000200)        /* Event Mask on line 9 */
#define  EXTI_EVENR_MR10                             ((uint32_t)0x00000400)        /* Event Mask on line 10 */
#define  EXTI_EVENR_MR11                             ((uint32_t)0x00000800)        /* Event Mask on line 11 */
#define  EXTI_EVENR_MR12                             ((uint32_t)0x00001000)        /* Event Mask on line 12 */
#define  EXTI_EVENR_MR13                             ((uint32_t)0x00002000)        /* Event Mask on line 13 */
#define  EXTI_EVENR_MR14                             ((uint32_t)0x00004000)        /* Event Mask on line 14 */
#define  EXTI_EVENR_MR15                             ((uint32_t)0x00008000)        /* Event Mask on line 15 */
#define  EXTI_EVENR_MR16                             ((uint32_t)0x00010000)        /* Event Mask on line 16 */
#define  EXTI_EVENR_MR17                             ((uint32_t)0x00020000)        /* Event Mask on line 17 */
#define  EXTI_EVENR_MR18                             ((uint32_t)0x00040000)        /* Event Mask on line 18 */
#define  EXTI_EVENR_MR19                             ((uint32_t)0x00080000)        /* Event Mask on line 19 */
#define  EXTI_EVENR_MR20                             ((uint32_t)0x00100000)        /* Event Mask on line 20 */
#define  EXTI_EVENR_MR21                             ((uint32_t)0x00200000)        /* Event Mask on line 21 */
#define  EXTI_EVENR_MR22                             ((uint32_t)0x00400000)        /* Event Mask on line 22 */
#define  EXTI_EVENR_MR23                             ((uint32_t)0x00800000)        /* Event Mask on line 23 */
#define  EXTI_EVENR_MR24                             ((uint32_t)0x01000000)        /* Event Mask on line 24 */
#define  EXTI_EVENR_MR25                             ((uint32_t)0x02000000)        /* Event Mask on line 25 */

