betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
#define GPIO_BSHR_BR0                                ((uint32_t)0x00010000)        /* Port x Reset bit 0 */
#define GPIO_BSHR_BR1                                ((uint32_t)0x00020000)        /* Port x Reset bit 1 */
#define GPIO_BSHR_BR2                                ((uint32_t)0x00040000)        /* Port x Reset bit 2 */
#define GPIO_BSHR_BR3                                ((uint32_t)0x00080000)        /* Port x Reset bit 3 */
#define GPIO_BSHR_BR4                                ((uint32_t)0x00100000)        /* Port x Reset bit 4 */
#define GPIO_BSHR_BR5                                ((uint32_t)0x00200000)        /* Port x Reset bit 5 */
#define GPIO_BSHR_BR6                                ((uint32_t)0x00400000)        /* Port x Reset bit 6 */
#define GPIO_BSHR_BR7                                ((uint32_t)0x00800000)        /* Port x Reset bit 7 */
#define GPIO_BSHR_BR8                                ((uint32_t)0x01000000)        /* Port x Reset bit 8 */
#define GPIO_BSHR_BR9                                ((uint32_t)0x02000000)        /* Port x Reset bit 9 */
#define GPIO_BSHR_BR10                               ((uint32_t)0x04000000)        /* Port x Reset bit 10 */
#define GPIO_BSHR_BR11                               ((uint32_t)0x08000000)        /* Port x Reset bit 11 */
#define GPIO_BSHR_BR12                               ((uint32_t)0x10000000)        /* Port x Reset bit 12 */
#define GPIO_BSHR_BR13                               ((uint32_t)0x20000000)        /* Port x Reset bit 13 */
#define GPIO_BSHR_BR14                               ((uint32_t)0x40000000)        /* Port x Reset bit 14 */
#define GPIO_BSHR_BR15                               ((uint32_t)0x80000000)        /* Port x Reset bit 15 */

/*******************  Bit definition for GPIO_BCR register  *******************/
#define GPIO_BCR_BR0                                 ((uint16_t)0x0001)            /* Port x Reset bit 0 */
#define GPIO_BCR_BR1                                 ((uint16_t)0x0002)            /* Port x Reset bit 1 */
#define GPIO_BCR_BR2                                 ((uint16_t)0x0004)            /* Port x Reset bit 2 */
#define GPIO_BCR_BR3                                 ((uint16_t)0x0008)            /* Port x Reset bit 3 */
#define GPIO_BCR_BR4                                 ((uint16_t)0x0010)            /* Port x Reset bit 4 */
#define GPIO_BCR_BR5                                 ((uint16_t)0x0020)            /* Port x Reset bit 5 */
#define GPIO_BCR_BR6                                 ((uint16_t)0x0040)            /* Port x Reset bit 6 */
#define GPIO_BCR_BR7                                 ((uint16_t)0x0080)            /* Port x Reset bit 7 */
#define GPIO_BCR_BR8                                 ((uint16_t)0x0100)            /* Port x Reset bit 8 */
#define GPIO_BCR_BR9                                 ((uint16_t)0x0200)            /* Port x Reset bit 9 */
#define GPIO_BCR_BR10                                ((uint16_t)0x0400)            /* Port x Reset bit 10 */
#define GPIO_BCR_BR11                                ((uint16_t)0x0800)            /* Port x Reset bit 11 */
#define GPIO_BCR_BR12                                ((uint16_t)0x1000)            /* Port x Reset bit 12 */
#define GPIO_BCR_BR13                                ((uint16_t)0x2000)            /* Port x Reset bit 13 */
#define GPIO_BCR_BR14                                ((uint16_t)0x4000)            /* Port x Reset bit 14 */
#define GPIO_BCR_BR15                                ((uint16_t)0x8000)            /* Port x Reset bit 15 */

/******************  Bit definition for GPIO_LCKR register  *******************/
#define GPIO_LCK0                                    ((uint32_t)0x00000001)        /* Port x Lock bit 0 */
#define GPIO_LCK1                                    ((uint32_t)0x00000002)        /* Port x Lock bit 1 */
#define GPIO_LCK2                                    ((uint32_t)0x00000004)        /* Port x Lock bit 2 */
#define GPIO_LCK3                                    ((uint32_t)0x00000008)        /* Port x Lock bit 3 */
#define GPIO_LCK4                                    ((uint32_t)0x00000010)        /* Port x Lock bit 4 */
#define GPIO_LCK5                                    ((uint32_t)0x00000020)        /* Port x Lock bit 5 */
#define GPIO_LCK6                                    ((uint32_t)0x00000040)        /* Port x Lock bit 6 */
#define GPIO_LCK7                                    ((uint32_t)0x00000080)        /* Port x Lock bit 7 */
#define GPIO_LCK8                                    ((uint32_t)0x00000100)        /* Port x Lock bit 8 */
#define GPIO_LCK9                                    ((uint32_t)0x00000200)        /* Port x Lock bit 9 */
#define GPIO_LCK10                                   ((uint32_t)0x00000400)        /* Port x Lock bit 10 */
#define GPIO_LCK11                                   ((uint32_t)0x00000800)        /* Port x Lock bit 11 */
#define GPIO_LCK12                                   ((uint32_t)0x00001000)        /* Port x Lock bit 12 */
#define GPIO_LCK13                                   ((uint32_t)0x00002000)        /* Port x Lock bit 13 */
#define GPIO_LCK14                                   ((uint32_t)0x00004000)        /* Port x Lock bit 14 */
#define GPIO_LCK15                                   ((uint32_t)0x00008000)        /* Port x Lock bit 15 */
#define GPIO_LCKK                                    ((uint32_t)0x00010000)        /* Lock key */

/******************  Bit definition for AFIO_PCFR1 register  ******************/
#define AFIO_PCFR1_PD0_1_REMAP                       ((uint32_t)0x00000001)
#define AFIO_PCFR1_ADC1_ETRGINJ_REMAP                ((uint32_t)0x00000002)
#define AFIO_PCFR1_ADC1_ETRGREG_REMAP                ((uint32_t)0x00000004)
#define AFIO_PCFR1_ADC2_ETRGINJ_REMAP                ((uint32_t)0x00000008)
#define AFIO_PCFR1_ADC2_ETRGREG_REMAP                ((uint32_t)0x00000010)

#define AFIO_PCFR1_UHSIF_CLK_REMAP                   ((uint32_t)0x000000C0)
#define AFIO_PCFR1_UHSIF_CLK_REMAP_0                 ((uint32_t)0x00000040)
#define AFIO_PCFR1_UHSIF_CLK_REMAP_1                 ((uint32_t)0x00000080)

