betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
#define AFIO_EXTICR1_EXTI7_PA                        ((uint32_t)0x00000000)            /* PA[7] pin */
#define AFIO_EXTICR1_EXTI7_PB                        ((uint32_t)0x10000000)            /* PB[7] pin */
#define AFIO_EXTICR1_EXTI7_PC                        ((uint32_t)0x20000000)            /* PC[7] pin */
#define AFIO_EXTICR1_EXTI7_PD                        ((uint32_t)0x30000000)            /* PD[7] pin */
#define AFIO_EXTICR1_EXTI7_PE                        ((uint32_t)0x40000000)            /* PE[7] pin */
#define AFIO_EXTICR1_EXTI7_PF                        ((uint32_t)0x50000000)            /* PF[7] pin */
#define AFIO_EXTICR1_EXTI7_CMPOUT                    ((uint32_t)0x60000000)            /* CMP OUT */

/******************  Bit definition for AFIO_EXTICR2 register  *******************/
#define AFIO_EXTICR2_EXTI8                           ((uint32_t)0x0000000F)        /* EXTI 0 configuration */
#define AFIO_EXTICR2_EXTI9                           ((uint32_t)0x000000F0)        /* EXTI 1 configuration */
#define AFIO_EXTICR2_EXTI10                          ((uint32_t)0x00000F00)        /* EXTI 2 configuration */
#define AFIO_EXTICR2_EXTI11                          ((uint32_t)0x0000F000)        /* EXTI 3 configuration */
#define AFIO_EXTICR2_EXTI12                          ((uint32_t)0x000F0000)        /* EXTI 4 configuration */
#define AFIO_EXTICR2_EXTI13                          ((uint32_t)0x00F00000)        /* EXTI 5 configuration */
#define AFIO_EXTICR2_EXTI14                          ((uint32_t)0x0F000000)        /* EXTI 6 configuration */
#define AFIO_EXTICR2_EXTI15                          ((uint32_t)0xF0000000)        /* EXTI 7 configuration */

#define AFIO_EXTICR2_EXTI8_PA                        ((uint32_t)0x00000000)            /* PA[0] pin */
#define AFIO_EXTICR2_EXTI8_PB                        ((uint32_t)0x00000001)            /* PB[0] pin */
#define AFIO_EXTICR2_EXTI8_PC                        ((uint32_t)0x00000002)            /* PC[0] pin */
#define AFIO_EXTICR2_EXTI8_PD                        ((uint32_t)0x00000003)            /* PD[0] pin */
#define AFIO_EXTICR2_EXTI8_PE                        ((uint32_t)0x00000004)            /* PE[0] pin */
#define AFIO_EXTICR2_EXTI8_PF                        ((uint32_t)0x00000005)            /* PF[0] pin */
#define AFIO_EXTICR2_EXTI8_CMPOUT                    ((uint32_t)0x00000006)            /* CMP OUT */

#define AFIO_EXTICR2_EXTI9_PA                        ((uint32_t)0x00000000)            /* PA[1] pin */
#define AFIO_EXTICR2_EXTI9_PB                        ((uint32_t)0x00000010)            /* PB[1] pin */
#define AFIO_EXTICR2_EXTI9_PC                        ((uint32_t)0x00000020)            /* PC[1] pin */
#define AFIO_EXTICR2_EXTI9_PD                        ((uint32_t)0x00000030)            /* PD[1] pin */
#define AFIO_EXTICR2_EXTI9_PE                        ((uint32_t)0x00000040)            /* PE[1] pin */
#define AFIO_EXTICR2_EXTI9_PF                        ((uint32_t)0x00000050)            /* PF[1] pin */
#define AFIO_EXTICR2_EXTI9_CMPOUT                    ((uint32_t)0x00000060)            /* CMP OUT */

#define AFIO_EXTICR2_EXTI10_PA                       ((uint32_t)0x00000000)            /* PA[2] pin */
#define AFIO_EXTICR2_EXTI10_PB                       ((uint32_t)0x00000100)            /* PB[2] pin */
#define AFIO_EXTICR2_EXTI10_PC                       ((uint32_t)0x00000200)            /* PC[2] pin */
#define AFIO_EXTICR2_EXTI10_PD                       ((uint32_t)0x00000300)            /* PD[2] pin */
#define AFIO_EXTICR2_EXTI10_PE                       ((uint32_t)0x00000400)            /* PE[2] pin */
#define AFIO_EXTICR2_EXTI10_PF                       ((uint32_t)0x00000500)            /* PF[2] pin */
#define AFIO_EXTICR2_EXTI10_CMPOUT                   ((uint32_t)0x00000600)            /* CMP OUT */

#define AFIO_EXTICR2_EXTI11_PA                       ((uint32_t)0x00000000)            /* PA[3] pin */
#define AFIO_EXTICR2_EXTI11_PB                       ((uint32_t)0x00001000)            /* PB[3] pin */
#define AFIO_EXTICR2_EXTI11_PC                       ((uint32_t)0x00002000)            /* PC[3] pin */
#define AFIO_EXTICR2_EXTI11_PD                       ((uint32_t)0x00003000)            /* PD[3] pin */
#define AFIO_EXTICR2_EXTI11_PE                       ((uint32_t)0x00004000)            /* PE[3] pin */
#define AFIO_EXTICR2_EXTI11_PF                       ((uint32_t)0x00005000)            /* PF[3] pin */
#define AFIO_EXTICR2_EXTI11_CMPOUT                   ((uint32_t)0x00006000)            /* CMP OUT */

#define AFIO_EXTICR2_EXTI12_PA                       ((uint32_t)0x00000000)            /* PA[4] pin */
#define AFIO_EXTICR2_EXTI12_PB                       ((uint32_t)0x00010000)            /* PB[4] pin */
#define AFIO_EXTICR2_EXTI12_PC                       ((uint32_t)0x00020000)            /* PC[4] pin */
#define AFIO_EXTICR2_EXTI12_PD                       ((uint32_t)0x00030000)            /* PD[4] pin */
#define AFIO_EXTICR2_EXTI12_PE                       ((uint32_t)0x00040000)            /* PE[4] pin */
#define AFIO_EXTICR2_EXTI12_PF                       ((uint32_t)0x00050000)            /* PF[4] pin */
#define AFIO_EXTICR2_EXTI12_CMPOUT                   ((uint32_t)0x00060000)            /* CMP OUT */

#define AFIO_EXTICR2_EXTI13_PA                       ((uint32_t)0x00000000)            /* PA[5] pin */
#define AFIO_EXTICR2_EXTI13_PB                       ((uint32_t)0x00100000)            /* PB[5] pin */
#define AFIO_EXTICR2_EXTI13_PC                       ((uint32_t)0x00200000)            /* PC[5] pin */
#define AFIO_EXTICR2_EXTI13_PD                       ((uint32_t)0x00300000)            /* PD[5] pin */
#define AFIO_EXTICR2_EXTI13_PE                       ((uint32_t)0x00400000)            /* PE[5] pin */
#define AFIO_EXTICR2_EXTI13_PF                       ((uint32_t)0x00500000)            /* PF[5] pin */
#define AFIO_EXTICR2_EXTI13_CMPOUT                   ((uint32_t)0x00600000)            /* CMP OUT */

#define AFIO_EXTICR2_EXTI14_PA                       ((uint32_t)0x00000000)            /* PA[6] pin */
#define AFIO_EXTICR2_EXTI14_PB                       ((uint32_t)0x01000000)            /* PB[6] pin */
#define AFIO_EXTICR2_EXTI14_PC                       ((uint32_t)0x02000000)            /* PC[6] pin */
#define AFIO_EXTICR2_EXTI14_PD                       ((uint32_t)0x03000000)            /* PD[6] pin */
#define AFIO_EXTICR2_EXTI14_PE                       ((uint32_t)0x04000000)            /* PE[6] pin */
#define AFIO_EXTICR2_EXTI14_PF                       ((uint32_t)0x05000000)            /* PF[6] pin */
#define AFIO_EXTICR2_EXTI14_CMPOUT                   ((uint32_t)0x06000000)            /* CMP OUT */

