betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/*******************  Bit definition for I2C_OADDR2 register  *******************/
#define  I2C_OADDR2_ENDUAL                           ((uint8_t)0x01)               /* Dual addressing mode enable */
#define  I2C_OADDR2_ADD2                             ((uint8_t)0xFE)               /* Interface address */

/********************  Bit definition for I2C_DATAR register  ********************/
#define  I2C_DR_DATAR                                ((uint8_t)0xFF)               /* 8-bit Data Register */

/*******************  Bit definition for I2C_STAR1 register  ********************/
#define  I2C_STAR1_SB                                ((uint16_t)0x0001)            /* Start Bit (Master mode) */
#define  I2C_STAR1_ADDR                              ((uint16_t)0x0002)            /* Address sent (master mode)/matched (slave mode) */
#define  I2C_STAR1_BTF                               ((uint16_t)0x0004)            /* Byte Transfer Finished */
#define  I2C_STAR1_ADD10                             ((uint16_t)0x0008)            /* 10-bit header sent (Master mode) */
#define  I2C_STAR1_STOPF                             ((uint16_t)0x0010)            /* Stop detection (Slave mode) */
#define  I2C_STAR1_RXNE                              ((uint16_t)0x0040)            /* Data Register not Empty (receivers) */
#define  I2C_STAR1_TXE                               ((uint16_t)0x0080)            /* Data Register Empty (transmitters) */
#define  I2C_STAR1_BERR                              ((uint16_t)0x0100)            /* Bus Error */
#define  I2C_STAR1_ARLO                              ((uint16_t)0x0200)            /* Arbitration Lost (master mode) */
#define  I2C_STAR1_AF                                ((uint16_t)0x0400)            /* Acknowledge Failure */
#define  I2C_STAR1_OVR                               ((uint16_t)0x0800)            /* Overrun/Underrun */
#define  I2C_STAR1_PECERR                            ((uint16_t)0x1000)            /* PEC Error in reception */
#define  I2C_STAR1_TIMEOUT                           ((uint16_t)0x4000)            /* Timeout or Tlow Error */
#define  I2C_STAR1_SMBALERT                          ((uint16_t)0x8000)            /* SMBus Alert */

/*******************  Bit definition for I2C_STAR2 register  ********************/
#define  I2C_STAR2_MSL                               ((uint16_t)0x0001)            /* Master/Slave */
#define  I2C_STAR2_BUSY                              ((uint16_t)0x0002)            /* Bus Busy */
#define  I2C_STAR2_TRA                               ((uint16_t)0x0004)            /* Transmitter/Receiver */
#define  I2C_STAR2_GENCALL                           ((uint16_t)0x0010)            /* General Call Address (Slave mode) */
#define  I2C_STAR2_SMBDEFAULT                        ((uint16_t)0x0020)            /* SMBus Device Default Address (Slave mode) */
#define  I2C_STAR2_SMBHOST                           ((uint16_t)0x0040)            /* SMBus Host Header (Slave mode) */
#define  I2C_STAR2_DUALF                             ((uint16_t)0x0080)            /* Dual Flag (Slave mode) */
#define  I2C_STAR2_PEC                               ((uint16_t)0xFF00)            /* Packet Error Checking Register */

/*******************  Bit definition for I2C_CKCFGR register  ********************/
#define  I2C_CKCFGR_CCR                              ((uint16_t)0x0FFF)            /* Clock Control Register in Fast/Standard mode (Master mode) */
#define  I2C_CKCFGR_DUTY                             ((uint16_t)0x4000)            /* Fast Mode Duty Cycle */
#define  I2C_CKCFGR_FS                               ((uint16_t)0x8000)            /* I2C Master Mode Selection */

/******************  Bit definition for I2C_RTR register  *******************/
#define  I2C_RTR_TRISE                               ((uint8_t)0x3F)               /* Maximum Rise Time in Fast/Standard mode (Master mode) */

/******************************************************************************/
/*                 Improved Inter-integrated Circuit Interface              */
/******************************************************************************/

/*******************  Bit definition for I3C_CTLR register  ********************/
#define  I3C_CTLR_DCNT                               ((uint32_t)0x0000FFFF)
#define  I3C_CTLR_RNW                                ((uint32_t)0x00010000)
#define  I3C_CTLR_ADD                                ((uint32_t)0x00FE0000)

#define  I3C_CTLR_CCC                                ((uint32_t)0x00FF0000)

#define  I3C_CTLR_MTYPE                              ((uint32_t)0x78000000)
#define  I3C_CTLR_MTYPE_0                            ((uint32_t)0x08000000)
#define  I3C_CTLR_MTYPE_1                            ((uint32_t)0x10000000)
#define  I3C_CTLR_MTYPE_2                            ((uint32_t)0x20000000)
#define  I3C_CTLR_MTYPE_3                            ((uint32_t)0x40000000)

#define  I3C_CTLR_MEND                               ((uint32_t)0x80000000)

/*******************  Bit definition for I3C_CFGR register  ********************/
#define  I3C_CFGR_EN                                 ((uint32_t)0x00000001)
#define  I3C_CFGR_CRINIT                             ((uint32_t)0x00000002)
#define  I3C_CFGR_NOARBH                             ((uint32_t)0x00000004)
#define  I3C_CFGR_RSTPTRN                            ((uint32_t)0x00000008)
#define  I3C_CFGR_EXITPTRN                           ((uint32_t)0x00000010)

#define  I3C_CFGR_HJACK                              ((uint32_t)0x00000080)
#define  I3C_CFGR_RXDMAEN                            ((uint32_t)0x00000100)
#define  I3C_CFGR_RXFLUSH                            ((uint32_t)0x00000200)
#define  I3C_CFGR_RXTHRES                            ((uint32_t)0x00000400)
      
#define  I3C_CFGR_TXMAEN                             ((uint32_t)0x00001000)
#define  I3C_CFGR_TXFLUSH                            ((uint32_t)0x00002000)
#define  I3C_CFGR_TXTHRES                            ((uint32_t)0x00004000)

#define  I3C_CFGR_SDMAEN                             ((uint32_t)0x00010000)
#define  I3C_CFGR_SFLUSH                             ((uint32_t)0x00020000)
#define  I3C_CFGR_SMODE                              ((uint32_t)0x00040000)
#define  I3C_CFGR_TMODE                              ((uint32_t)0x00080000)
#define  I3C_CFGR_CDMAEN                             ((uint32_t)0x00010000)
#define  I3C_CFGR_CFLUSH                             ((uint32_t)0x00020000)

#define  I3C_CFGR_TSFSET                             ((uint32_t)0x40000000)

/*******************  Bit definition for I3C_RDR register  ********************/
#define  I3C_RDR_RDB0                                ((uint32_t)0x000000FF)

/*******************  Bit definition for I3C_RDWR register  ********************/
#define  I3C_RDWR_RDB0                               ((uint32_t)0x000000FF)
#define  I3C_RDWR_RDB1                               ((uint32_t)0x0000FF00)
#define  I3C_RDWR_RDB2                               ((uint32_t)0x00FF0000)
#define  I3C_RDWR_RDB3                               ((uint32_t)0xFF000000)

/*******************  Bit definition for I3C_TDR register  ********************/
#define  I3C_TDR_TDB0                                ((uint32_t)0x000000FF)

/*******************  Bit definition for I3C_TDWR register  ********************/
#define  I3C_TDWR_TDB0                               ((uint32_t)0x000000FF)
#define  I3C_TDWR_TDB1                               ((uint32_t)0x0000FF00)
#define  I3C_TDWR_TDB2                               ((uint32_t)0x00FF0000)
#define  I3C_TDWR_TDB3                               ((uint32_t)0xFF000000)

/*******************  Bit definition for I3C_IBIDR register  ********************/
#define  I3C_IBIDR_IBIDB0                            ((uint32_t)0x000000FF)
#define  I3C_IBIDR_IBIDB1                            ((uint32_t)0x0000FF00)
#define  I3C_IBIDR_IBIDB2                            ((uint32_t)0x00FF0000)
#define  I3C_IBIDR_IBIDB3                            ((uint32_t)0xFF000000)

/*******************  Bit definition for I3C_TGTTDR register  ********************/
#define  I3C_TGTTDR_TGTTDCNT                         ((uint32_t)0x0000FFFF)
#define  I3C_TGTTDR_PRELOAD                          ((uint32_t)0x00010000)

