betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/*******************  Bit definition for I3C_RESET register  ********************/
#define  I3C_RESET_HST_SIE_RST                       ((uint32_t)0x01000000)
#define  I3C_RESET_TGT_SIE_RST                       ((uint32_t)0x02000000)

/*******************  Bit definition for I3C_STATR register  ********************/
#define  I3C_STATR_XDCNT                             ((uint32_t)0x0000FFFF)
#define  I3C_STATR_ABT                               ((uint32_t)0x00020000)
#define  I3C_STATR_DIR                               ((uint32_t)0x00040000)

#define  I3C_STATR_MID                               ((uint32_t)0xFF000000)

/*******************  Bit definition for I3C_STATER register  ********************/
#define  I3C_STATER_CODERR                           ((uint32_t)0x0000000F)
#define  I3C_STATER_PERR                             ((uint32_t)0x00000010)
#define  I3C_STATER_STALL                            ((uint32_t)0x00000020)
#define  I3C_STATER_DOVR                             ((uint32_t)0x00000040)
#define  I3C_STATER_COVR                             ((uint32_t)0x00000080)
#define  I3C_STATER_ANACK                            ((uint32_t)0x00000100)
#define  I3C_STATER_DNACK                            ((uint32_t)0x00000200)
#define  I3C_STATER_DERR                             ((uint32_t)0x00000400)

/*******************  Bit definition for I3C_RMR register  ********************/
#define  I3C_RMR_IBIRDCNT                            ((uint32_t)0x00000007)
#define  I3C_RMR_RCODE                               ((uint32_t)0x0000FF00)
#define  I3C_RMR_RADD                                ((uint32_t)0x00FE0000)

/*******************  Bit definition for I3C_EVR register  ********************/
#define  I3C_EVR_CFEF                                ((uint32_t)0x00000001)
#define  I3C_EVR_TXFEF                               ((uint32_t)0x00000002)
#define  I3C_EVR_CFNFF                               ((uint32_t)0x00000004)
#define  I3C_EVR_SFNEF                               ((uint32_t)0x00000008)
#define  I3C_EVR_TXFNFF                              ((uint32_t)0x00000010)
#define  I3C_EVR_RXFNEF                              ((uint32_t)0x00000020)
#define  I3C_EVR_TXLASTF                             ((uint32_t)0x00000040)
#define  I3C_EVR_RXLASTF                             ((uint32_t)0x00000080)

#define  I3C_EVR_FCF                                 ((uint32_t)0x00000200)
#define  I3C_EVR_RXTGTENDF                           ((uint32_t)0x00000400)
#define  I3C_EVR_ERRF                                ((uint32_t)0x00000800)

#define  I3C_EVR_IBIF                                ((uint32_t)0x00008000)
#define  I3C_EVR_IBIENDF                             ((uint32_t)0x00010000)
#define  I3C_EVR_CRF                                 ((uint32_t)0x00020000)
#define  I3C_EVR_CRUPDF                              ((uint32_t)0x00040000)
#define  I3C_EVR_HJF                                 ((uint32_t)0x00080000)
#define  I3C_EVR_WKPF                                ((uint32_t)0x00200000)
#define  I3C_EVR_GETF                                ((uint32_t)0x00400000)
#define  I3C_EVR_STAF                                ((uint32_t)0x00800000)
#define  I3C_EVR_DAUPDF                              ((uint32_t)0x01000000)
#define  I3C_EVR_MWLUPDF                             ((uint32_t)0x02000000)
#define  I3C_EVR_MRLUPDF                             ((uint32_t)0x04000000)
#define  I3C_EVR_RSTF                                ((uint32_t)0x08000000)
#define  I3C_EVR_ASUPDF                              ((uint32_t)0x10000000)
#define  I3C_EVR_INTUPDF                             ((uint32_t)0x20000000)
#define  I3C_EVR_DEFF                                ((uint32_t)0x40000000)
#define  I3C_EVR_GRPF                                ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_INTENR register  ******************/
#define  I3C_INTENR_CFNFIE                           ((uint32_t)0x00000004)
#define  I3C_INTENR_SFNEIE                           ((uint32_t)0x00000008)
#define  I3C_INTENR_TXFNEIE                          ((uint32_t)0x00000010)
#define  I3C_INTENR_RXFNEIE                          ((uint32_t)0x00000020)

#define  I3C_INTENR_FCIE                             ((uint32_t)0x00000200)
#define  I3C_INTENR_RXTGTENDIE                       ((uint32_t)0x00000400)
#define  I3C_INTENR_ERRIE                            ((uint32_t)0x00000800)

#define  I3C_INTENR_IBIIE                            ((uint32_t)0x00008000)
#define  I3C_INTENR_IBIENDIE                         ((uint32_t)0x00010000)
#define  I3C_INTENR_CRIE                             ((uint32_t)0x00020000)
#define  I3C_INTENR_CRUPDIE                          ((uint32_t)0x00040000)
#define  I3C_INTENR_HJIE                             ((uint32_t)0x00080000)

#define  I3C_INTENR_WKPIE                            ((uint32_t)0x00200000)
#define  I3C_INTENR_GETIE                            ((uint32_t)0x00400000)
#define  I3C_INTENR_STAIE                            ((uint32_t)0x00800000)
#define  I3C_INTENR_DAUPDIE                          ((uint32_t)0x01000000)
#define  I3C_INTENR_MWLUPDIE                         ((uint32_t)0x02000000)
#define  I3C_INTENR_MRLUPDIE                         ((uint32_t)0x04000000)
#define  I3C_INTENR_RSTIE                            ((uint32_t)0x08000000)
#define  I3C_INTENR_ASUPDIE                          ((uint32_t)0x10000000)
#define  I3C_INTENR_INTUPDIE                         ((uint32_t)0x20000000)
#define  I3C_INTENR_DEFIE                            ((uint32_t)0x40000000)
#define  I3C_INTENR_GRPIE                            ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_CEVR register  ******************/
#define  I3C_CEVR_CFCR                               ((uint32_t)0x00000200)
#define  I3C_CEVR_CRXTGTENDF                         ((uint32_t)0x00000400)
#define  I3C_CEVR_CERRF                              ((uint32_t)0x00000800)

#define  I3C_CEVR_CIBIF                              ((uint32_t)0x00008000)
#define  I3C_CEVR_CIBIENDF                           ((uint32_t)0x00010000)
#define  I3C_CEVR_CCRF                               ((uint32_t)0x00020000)
#define  I3C_CEVR_CCRUPDF                            ((uint32_t)0x00040000)
#define  I3C_CEVR_CHJF                               ((uint32_t)0x00080000)

#define  I3C_CEVR_CWKPF                              ((uint32_t)0x00200000)
#define  I3C_CEVR_CGETF                              ((uint32_t)0x00400000)
#define  I3C_CEVR_CSTAF                              ((uint32_t)0x00800000)
#define  I3C_CEVR_CDAUPDF                            ((uint32_t)0x01000000)
#define  I3C_CEVR_CMWLUPDF                           ((uint32_t)0x02000000)
#define  I3C_CEVR_CMRLUPDF                           ((uint32_t)0x04000000)
#define  I3C_CEVR_CRSTF                              ((uint32_t)0x08000000)
#define  I3C_CEVR_CASUPDF                            ((uint32_t)0x10000000)
#define  I3C_CEVR_CINTUPDF                           ((uint32_t)0x20000000)
#define  I3C_CEVR_CDEFF                              ((uint32_t)0x40000000)
#define  I3C_CEVR_CGRPF                              ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_DEVR0 register  ******************/
#define  I3C_DEVR0_DAVAL                             ((uint32_t)0x00000001)
#define  I3C_DEVR0_DA                                ((uint32_t)0x000000FE)

#define  I3C_DEVR0_IBIEN                             ((uint32_t)0x00010000)
#define  I3C_DEVR0_CREN                              ((uint32_t)0x00020000)

#define  I3C_DEVR0_HJEN                              ((uint32_t)0x00080000)

#define  I3C_DEVR0_AS                                ((uint32_t)0x00300000)
#define  I3C_DEVR0_AS_0                              ((uint32_t)0x00100000)
#define  I3C_DEVR0_AS_1                              ((uint32_t)0x00200000)

#define  I3C_DEVR0_RSTACT                            ((uint32_t)0x00C00000)
#define  I3C_DEVR0_RSTACT_0                          ((uint32_t)0x00400000)
#define  I3C_DEVR0_RSTACT_1                          ((uint32_t)0x00800000)

#define  I3C_DEVR0_RSTVAL                            ((uint32_t)0x01000000)

