betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/*******************  Bit definition for LPTIM_ICR register  *******************/
#define LPTIM_ICR_CMPMCF                             ((uint32_t)0x00000001)
#define LPTIM_ICR_ARRMCF                             ((uint32_t)0x00000002)
#define LPTIM_ICR_EXTTRIGCF                          ((uint32_t)0x00000004)
#define LPTIM_ICR_CMPOKCF                            ((uint32_t)0x00000008)
#define LPTIM_ICR_ARROKCF                            ((uint32_t)0x00000010)
#define LPTIM_ICR_UPCF                               ((uint32_t)0x00000020)
#define LPTIM_ICR_DOWNCF                             ((uint32_t)0x00000040)

/*******************  Bit definition for LPTIM_IER register  *******************/
#define LPTIM_IER_CMPMIE                             ((uint32_t)0x00000001)
#define LPTIM_IER_ARRMIE                             ((uint32_t)0x00000002)
#define LPTIM_IER_EXTTRIGIE                          ((uint32_t)0x00000004)
#define LPTIM_IER_CMPOKIE                            ((uint32_t)0x00000008)
#define LPTIM_IER_ARROKIE                            ((uint32_t)0x00000010)
#define LPTIM_IER_UPIE                               ((uint32_t)0x00000020)
#define LPTIM_IER_DOWNIE                             ((uint32_t)0x00000040)

/*******************  Bit definition for LPTIM_CFGR register  *******************/
#define LPTIM_CFGR_CKSEL                             ((uint32_t)0x00000001)
#define LPTIM_CFGR_CKPOL                             ((uint32_t)0x00000006)
#define LPTIM_CFGR_CKFLT                             ((uint32_t)0x00000018)
#define LPTIM_CFGR_TRGFLT                            ((uint32_t)0x000000C0)
#define LPTIM_CFGR_PRESC                             ((uint32_t)0x00000E00)
#define LPTIM_CFGR_TRIGSEL                           ((uint32_t)0x00006000)
#define LPTIM_CFGR_TRIGEN                            ((uint32_t)0x00060000)
#define LPTIM_CFGR_TIMOUT                            ((uint32_t)0x00080000)
#define LPTIM_CFGR_WAVE                              ((uint32_t)0x00100000)
#define LPTIM_CFGR_WAVPOL                            ((uint32_t)0x00200000)
#define LPTIM_CFGR_PRELOAD                           ((uint32_t)0x00400000)
#define LPTIM_CFGR_CONTMODE                          ((uint32_t)0x00800000)
#define LPTIM_CFGR_ENC                               ((uint32_t)0x01000000)
#define LPTIM_CFGR_CLKSEL                            ((uint32_t)0x06000000)
#define LPTIM_CFGR_FORCEPWM                          ((uint32_t)0x08000000)

/*******************  Bit definition for LPTIM_CR register  *******************/
#define LPTIM_CR_ENABLE                              ((uint32_t)0x00000001)
#define LPTIM_CR_SNGSTRT                             ((uint32_t)0x00000002)
#define LPTIM_CR_CNTSTRT                             ((uint32_t)0x00000004)
#define LPTIM_CR_OUTEN                               ((uint32_t)0x00000008)
#define LPTIM_CR_DIR_EXTEN                           ((uint32_t)0x00000010)

/*******************  Bit definition for LPTIM_CMP register  *******************/
#define LPTIM_CMP                                    ((uint32_t)0x0000FFFF)

/*******************  Bit definition for LPTIM_ARR register  *******************/
#define LPTIM_ARR                                    ((uint32_t)0x0000FFFF)

/*******************  Bit definition for LPTIM_CNT register  *******************/
#define LPTIM_COUNT                                  ((uint32_t)0x0000FFFF)

/******************************************************************************/
/*                             Power Control                                  */
/******************************************************************************/

/********************  Bit definition for PWR_CTLR register  ********************/
#define  PWR_CTLR_LPDS                               ((uint16_t)0x0001)     /* Low-Power Deepsleep */
#define  PWR_CTLR_PVDE                               ((uint16_t)0x0010)     /* Power Voltage Detector Enable */

#define  PWR_CTLR_PLS                                ((uint16_t)0x00E0)     /* PLS[2:0] bits (PVD Level Selection) */
#define  PWR_CTLR_PLS_0                              ((uint16_t)0x0020)     /* Bit 0 */
#define  PWR_CTLR_PLS_1                              ((uint16_t)0x0040)     /* Bit 1 */
#define  PWR_CTLR_PLS_2                              ((uint16_t)0x0080)     /* Bit 2 */

#define  PWR_CTLR_PLS_MODE0                          ((uint16_t)0x0000)     
#define  PWR_CTLR_PLS_MODE1                          ((uint16_t)0x0020)     
#define  PWR_CTLR_PLS_MODE2                          ((uint16_t)0x0040)     
#define  PWR_CTLR_PLS_MODE3                          ((uint16_t)0x0060)     
#define  PWR_CTLR_PLS_MODE4                          ((uint16_t)0x0080)     
#define  PWR_CTLR_PLS_MODE5                          ((uint16_t)0x00A0)     
#define  PWR_CTLR_PLS_MODE6                          ((uint16_t)0x00C0)     
#define  PWR_CTLR_PLS_MODE7                          ((uint16_t)0x00E0)     

#define  PWR_CTLR_DBP                                ((uint16_t)0x0100)     /* Disable Backup Domain write protection */
#define  PWR_CTLR_VIO_SWCR                           ((uint16_t)0x0200)

#define  PWR_CTLR_VSEL_VIO18                         ((uint16_t)0x1C00)
#define  PWR_CTLR_VSEL_VIO18_0                       ((uint16_t)0x0400)
#define  PWR_CTLR_VSEL_VIO18_1                       ((uint16_t)0x0800)
#define  PWR_CTLR_VSEL_VIO18_2                       ((uint16_t)0x1000)

#define  PWR_CTLR_VSEL_VIO18_MODE0                   ((uint16_t)0x0000)
#define  PWR_CTLR_VSEL_VIO18_MODE1                   ((uint16_t)0x0400)
#define  PWR_CTLR_VSEL_VIO18_MODE2                   ((uint16_t)0x0800)
#define  PWR_CTLR_VSEL_VIO18_MODE3                   ((uint16_t)0x0C00)
#define  PWR_CTLR_VSEL_VIO18_MODE4                   ((uint16_t)0x1000)
#define  PWR_CTLR_VSEL_VIO18_MODE5                   ((uint16_t)0x1400)
#define  PWR_CTLR_VSEL_VIO18_MODE6                   ((uint16_t)0x1800)
#define  PWR_CTLR_VSEL_VIO18_MODE7                   ((uint16_t)0x1C00)

/*******************  Bit definition for PWR_CSR register  ********************/
#define  PWR_CSR_PVDO                                ((uint16_t)0x0001)

#define  PWR_CSR_VIO18_SR                            ((uint16_t)0x0300)
#define  PWR_CSR_VIO18_SR_0                          ((uint16_t)0x0100)
#define  PWR_CSR_VIO18_SR_1                          ((uint16_t)0x0200)

/******************************************************************************/
/*                         Reset and Clock Control                            */
/******************************************************************************/

/********************  Bit definition for RCC_CTLR register  ********************/
#define  RCC_HSION                                   ((uint32_t)0x00000001)        /* Internal High Speed clock enable */
#define  RCC_HSIRDY                                  ((uint32_t)0x00000002)        /* Internal High Speed clock ready flag */
#define  RCC_HSITRIM                                 ((uint32_t)0x000000F8)        /* Internal High Speed clock trimming */
#define  RCC_HSICAL                                  ((uint32_t)0x0000FF00)        /* Internal High Speed clock Calibration */
#define  RCC_HSEON                                   ((uint32_t)0x00010000)        /* External High Speed clock enable */
#define  RCC_HSERDY                                  ((uint32_t)0x00020000)        /* External High Speed clock ready flag */
#define  RCC_HSEBYP                                  ((uint32_t)0x00040000)        /* External High Speed clock Bypass */
#define  RCC_CSSON                                   ((uint32_t)0x00080000)        /* Clock Security System enable */
#define  RCC_USBHS_PLLON                             ((uint32_t)0x00100000)
#define  RCC_USBHS_PLLRDY                            ((uint32_t)0x00200000)
#define  RCC_USBSS_PLLON                             ((uint32_t)0x00400000)
#define  RCC_USBSS_PLLRDY                            ((uint32_t)0x00800000)
#define  RCC_PLLON                                   ((uint32_t)0x01000000)        /* PLL enable */
#define  RCC_PLLRDY                                  ((uint32_t)0x02000000)        /* PLL clock ready flag */
#define  RCC_ETH_PLLON                               ((uint32_t)0x04000000)
#define  RCC_ETH_PLLRDY                              ((uint32_t)0x08000000)
#define  RCC_SERDES_PLLON                            ((uint32_t)0x10000000)
#define  RCC_SERDES_PLLRDY                           ((uint32_t)0x20000000)
#define  RCC_CSS_HSE_DIS                             ((uint32_t)0x80000000)
            
/*******************  Bit definition for RCC_CFGR0 register  *******************/
#define  RCC_SW                                      ((uint32_t)0x00000003)        /* SW[1:0] bits (System clock Switch) */
#define  RCC_SW_0                                    ((uint32_t)0x00000001)        /* Bit 0 */
#define  RCC_SW_1                                    ((uint32_t)0x00000002)        /* Bit 1 */

#define  RCC_SW_HSI                                  ((uint32_t)0x00000000)        /* HSI selected as system clock */
#define  RCC_SW_HSE                                  ((uint32_t)0x00000001)        /* HSE selected as system clock */
#define  RCC_SW_PLL                                  ((uint32_t)0x00000002)        /* PLL selected as system clock */

#define  RCC_SWS                                     ((uint32_t)0x0000000C)        /* SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_SWS_0                                   ((uint32_t)0x00000004)        /* Bit 0 */
#define  RCC_SWS_1                                   ((uint32_t)0x00000008)        /* Bit 1 */

