betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
#define  RCC_PLL_SRC_DIV                             ((uint32_t)0x00003F00)
#define  RCC_PLL_SRC_DIV_0                           ((uint32_t)0x00000100)
#define  RCC_PLL_SRC_DIV_1                           ((uint32_t)0x00000200)
#define  RCC_PLL_SRC_DIV_2                           ((uint32_t)0x00000400)
#define  RCC_PLL_SRC_DIV_3                           ((uint32_t)0x00000800)
#define  RCC_PLL_SRC_DIV_4                           ((uint32_t)0x00001000)
#define  RCC_PLL_SRC_DIV_5                           ((uint32_t)0x00002000)

#define  RCC_PLL_SRC_DIV1                            ((uint32_t)0x00000000)
#define  RCC_PLL_SRC_DIV2                            ((uint32_t)0x00000100)
#define  RCC_PLL_SRC_DIV3                            ((uint32_t)0x00000200)
#define  RCC_PLL_SRC_DIV4                            ((uint32_t)0x00000300)
#define  RCC_PLL_SRC_DIV5                            ((uint32_t)0x00000400)
#define  RCC_PLL_SRC_DIV6                            ((uint32_t)0x00000500)
#define  RCC_PLL_SRC_DIV7                            ((uint32_t)0x00000600)
#define  RCC_PLL_SRC_DIV8                            ((uint32_t)0x00000700)
#define  RCC_PLL_SRC_DIV9                            ((uint32_t)0x00000800)
#define  RCC_PLL_SRC_DIV10                           ((uint32_t)0x00000900)
#define  RCC_PLL_SRC_DIV11                           ((uint32_t)0x00000A00)
#define  RCC_PLL_SRC_DIV12                           ((uint32_t)0x00000B00)
#define  RCC_PLL_SRC_DIV13                           ((uint32_t)0x00000C00)
#define  RCC_PLL_SRC_DIV14                           ((uint32_t)0x00000D00)
#define  RCC_PLL_SRC_DIV15                           ((uint32_t)0x00000E00)
#define  RCC_PLL_SRC_DIV16                           ((uint32_t)0x00000F00)
#define  RCC_PLL_SRC_DIV17                           ((uint32_t)0x00001000)
#define  RCC_PLL_SRC_DIV18                           ((uint32_t)0x00001100)
#define  RCC_PLL_SRC_DIV19                           ((uint32_t)0x00001200)
#define  RCC_PLL_SRC_DIV20                           ((uint32_t)0x00001300)
#define  RCC_PLL_SRC_DIV21                           ((uint32_t)0x00001400)
#define  RCC_PLL_SRC_DIV22                           ((uint32_t)0x00001500)
#define  RCC_PLL_SRC_DIV23                           ((uint32_t)0x00001600)
#define  RCC_PLL_SRC_DIV24                           ((uint32_t)0x00001700)
#define  RCC_PLL_SRC_DIV25                           ((uint32_t)0x00001800)
#define  RCC_PLL_SRC_DIV26                           ((uint32_t)0x00001900)
#define  RCC_PLL_SRC_DIV27                           ((uint32_t)0x00001A00)
#define  RCC_PLL_SRC_DIV28                           ((uint32_t)0x00001B00)
#define  RCC_PLL_SRC_DIV29                           ((uint32_t)0x00001C00)
#define  RCC_PLL_SRC_DIV30                           ((uint32_t)0x00001D00)
#define  RCC_PLL_SRC_DIV31                           ((uint32_t)0x00001E00)
#define  RCC_PLL_SRC_DIV32                           ((uint32_t)0x00001F00)
#define  RCC_PLL_SRC_DIV33                           ((uint32_t)0x00002000)
#define  RCC_PLL_SRC_DIV34                           ((uint32_t)0x00002100)
#define  RCC_PLL_SRC_DIV35                           ((uint32_t)0x00002200)
#define  RCC_PLL_SRC_DIV36                           ((uint32_t)0x00002300)
#define  RCC_PLL_SRC_DIV37                           ((uint32_t)0x00002400)
#define  RCC_PLL_SRC_DIV38                           ((uint32_t)0x00002500)
#define  RCC_PLL_SRC_DIV39                           ((uint32_t)0x00002600)
#define  RCC_PLL_SRC_DIV40                           ((uint32_t)0x00002700)
#define  RCC_PLL_SRC_DIV41                           ((uint32_t)0x00002800)
#define  RCC_PLL_SRC_DIV42                           ((uint32_t)0x00002900)
#define  RCC_PLL_SRC_DIV43                           ((uint32_t)0x00002A00)
#define  RCC_PLL_SRC_DIV44                           ((uint32_t)0x00002B00)
#define  RCC_PLL_SRC_DIV45                           ((uint32_t)0x00002C00)
#define  RCC_PLL_SRC_DIV46                           ((uint32_t)0x00002D00)
#define  RCC_PLL_SRC_DIV47                           ((uint32_t)0x00002E00)
#define  RCC_PLL_SRC_DIV48                           ((uint32_t)0x00002F00)
#define  RCC_PLL_SRC_DIV49                           ((uint32_t)0x00003000)
#define  RCC_PLL_SRC_DIV50                           ((uint32_t)0x00003100)
#define  RCC_PLL_SRC_DIV51                           ((uint32_t)0x00003200)
#define  RCC_PLL_SRC_DIV52                           ((uint32_t)0x00003300)
#define  RCC_PLL_SRC_DIV53                           ((uint32_t)0x00003400)
#define  RCC_PLL_SRC_DIV54                           ((uint32_t)0x00003500)
#define  RCC_PLL_SRC_DIV55                           ((uint32_t)0x00003600)
#define  RCC_PLL_SRC_DIV56                           ((uint32_t)0x00003700)
#define  RCC_PLL_SRC_DIV57                           ((uint32_t)0x00003800)
#define  RCC_PLL_SRC_DIV58                           ((uint32_t)0x00003900)
#define  RCC_PLL_SRC_DIV59                           ((uint32_t)0x00003A00)
#define  RCC_PLL_SRC_DIV60                           ((uint32_t)0x00003B00)
#define  RCC_PLL_SRC_DIV61                           ((uint32_t)0x00003C00)
#define  RCC_PLL_SRC_DIV62                           ((uint32_t)0x00003D00)
#define  RCC_PLL_SRC_DIV63                           ((uint32_t)0x00003E00)
#define  RCC_PLL_SRC_DIV64                           ((uint32_t)0x00003F00)

#define  RCC_SYSPLL_SEL                              ((uint32_t)0x70000000)
#define  RCC_SYSPLL_SEL_0                            ((uint32_t)0x10000000)
#define  RCC_SYSPLL_SEL_1                            ((uint32_t)0x20000000)
#define  RCC_SYSPLL_SEL_2                            ((uint32_t)0x40000000)

#define  RCC_SYSPLL_PLL                              ((uint32_t)0x00000000)
#define  RCC_SYSPLL_USBHS                            ((uint32_t)0x40000000)
#define  RCC_SYSPLL_ETH                              ((uint32_t)0x50000000)
#define  RCC_SYSPLL_SERDES                           ((uint32_t)0x60000000)
#define  RCC_SYSPLL_USBSS                            ((uint32_t)0x70000000)

#define  RCC_SYSPLL_GATE                             ((uint32_t)0x80000000)

