betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
#define  RCC_LTDCSRC_PLLCLK                          ((uint32_t)0x00000000)
#define  RCC_LTDCSRC_SERDESPLL                       ((uint32_t)0x00004000)
#define  RCC_LTDCSRC_ETHPLL                          ((uint32_t)0x00008000)
#define  RCC_LTDCSRC_USBHSPLL                        ((uint32_t)0x0000C000)

#define  RCC_USBFSDIV                                ((uint32_t)0x000F0000)
#define  RCC_USBFSDIV_0                              ((uint32_t)0x00010000)
#define  RCC_USBFSDIV_1                              ((uint32_t)0x00020000)
#define  RCC_USBFSDIV_2                              ((uint32_t)0x00040000)
#define  RCC_USBFSDIV_3                              ((uint32_t)0x00080000)

#define  RCC_USBFSDIV_DIV1                           ((uint32_t)0x00000000)
#define  RCC_USBFSDIV_DIV2                           ((uint32_t)0x00010000)
#define  RCC_USBFSDIV_DIV3                           ((uint32_t)0x00020000)
#define  RCC_USBFSDIV_DIV4                           ((uint32_t)0x00030000)
#define  RCC_USBFSDIV_DIV5                           ((uint32_t)0x00040000)
#define  RCC_USBFSDIV_DIV6                           ((uint32_t)0x00050000)
#define  RCC_USBFSDIV_DIV8                           ((uint32_t)0x00060000)
#define  RCC_USBFSDIV_DIV10                          ((uint32_t)0x00070000)
#define  RCC_USBFSDIV_DIV1_5                         ((uint32_t)0x00080000)
#define  RCC_USBFSDIV_DIV2_5                         ((uint32_t)0x00090000)
#define  RCC_USBFSDIV_DIV3_5                         ((uint32_t)0x000A0000)
#define  RCC_USBFSDIV_DIV4_5                         ((uint32_t)0x000B0000)
#define  RCC_USBFSDIV_DIV5_5                         ((uint32_t)0x000C0000)
#define  RCC_USBFSDIV_DIV6_5                         ((uint32_t)0x000D0000)
#define  RCC_USBFSDIV_DIV7_5                         ((uint32_t)0x000E0000)
#define  RCC_USBFSDIV_DIV9_5                         ((uint32_t)0x000F0000)

#define  RCC_USBFSSRC                                ((uint32_t)0x00100000)

#define  RCC_USBFSSRC_PLLCLK                         ((uint32_t)0x00000000)
#define  RCC_USBFSSRC_USBHSPLL                       ((uint32_t)0x00100000)

#define  RCC_RNGSRC                                  ((uint32_t)0x00800000)

#define  RCC_RNGSRC_SYSCLK                           ((uint32_t)0x00000000)
#define  RCC_RNGSRC_PLLCLK                           ((uint32_t)0x00800000)

#define  RCC_I2S2SRC                                 ((uint32_t)0x01000000)

#define  RCC_I2S2SRC_SYSCLK                          ((uint32_t)0x00000000)
#define  RCC_I2S2SRC_PLLCLK                          ((uint32_t)0x01000000)

#define  RCC_I2S3SRC                                 ((uint32_t)0x02000000)

#define  RCC_I2S3SRC_SYSCLK                          ((uint32_t)0x00000000)
#define  RCC_I2S3SRC_PLLCLK                          ((uint32_t)0x02000000)

#define  RCC_HSADCSRC                                ((uint32_t)0x30000000)
#define  RCC_HSADCSRC_0                              ((uint32_t)0x10000000)
#define  RCC_HSADCSRC_1                              ((uint32_t)0x20000000)

#define  RCC_HSADCSRC_SYSCLK                         ((uint32_t)0x00000000)
#define  RCC_HSADCSRC_PLLCLK                         ((uint32_t)0x10000000)
#define  RCC_HSADCSRC_USBHSPLL                       ((uint32_t)0x20000000)
#define  RCC_HSADCSRC_ETHPLL                         ((uint32_t)0x30000000)

#define  RCC_ETH1GSRC                                ((uint32_t)0xC0000000)
#define  RCC_ETH1GSRC_0                              ((uint32_t)0x40000000)
#define  RCC_ETH1GSRC_1                              ((uint32_t)0x80000000)

#define  RCC_ETH1GSRC_PLLCLK                         ((uint32_t)0x00000000)
#define  RCC_ETH1GSRC_USBSSPLL                       ((uint32_t)0x40000000)
#define  RCC_ETH1GSRC_ETHPLL_DIV4                    ((uint32_t)0x80000000)
#define  RCC_ETH1GSRC_SERDESPLL_DIV8                 ((uint32_t)0xC0000000)

/*******************  Bit definition for RCC_PLLCFGR2 register  ********************/
#define  RCC_USBHSPLLSRC                             ((uint32_t)0x00000003)
#define  RCC_USBHSPLLSRC_0                           ((uint32_t)0x00000001)
#define  RCC_USBHSPLLSRC_1                           ((uint32_t)0x00000002)

#define  RCC_USBHSPLLSRC_HSE                         ((uint32_t)0x00000000)
#define  RCC_USBHSPLLSRC_HSI                         ((uint32_t)0x00000001)
#define  RCC_USBHSPLLSRC_ETHCLK_20M                  ((uint32_t)0x00000002)
#define  RCC_USBHSPLLSRC_PLLCLK                      ((uint32_t)0x00000003)

#define  RCC_USBHSPLL_REFSEL                         ((uint32_t)0x0000000C)
#define  RCC_USBHSPLL_REFSEL_0                       ((uint32_t)0x00000004)
#define  RCC_USBHSPLL_REFSEL_1                       ((uint32_t)0x00000008)

#define  RCC_USBHSPLL_REFSEL_25MHZ                   ((uint32_t)0x00000000)
#define  RCC_USBHSPLL_REFSEL_20MHZ                   ((uint32_t)0x00000004)
#define  RCC_USBHSPLL_REFSEL_24MHZ                   ((uint32_t)0x00000008)
#define  RCC_USBHSPLL_REFSEL_32MHZ                   ((uint32_t)0x0000000C)

#define  RCC_USBSSPLL_REFSEL                         ((uint32_t)0x00000070)
#define  RCC_USBSSPLL_REFSEL_0                       ((uint32_t)0x00000010)
#define  RCC_USBSSPLL_REFSEL_1                       ((uint32_t)0x00000020)
#define  RCC_USBSSPLL_REFSEL_2                       ((uint32_t)0x00000030)

#define  RCC_USBSSPLL_REFSEL_20MHz                   ((uint32_t)0x00000000)
#define  RCC_USBSSPLL_REFSEL_24MHz                   ((uint32_t)0x00000010)
#define  RCC_USBSSPLL_REFSEL_25MHz                   ((uint32_t)0x00000020)
#define  RCC_USBSSPLL_REFSEL_30MHz                   ((uint32_t)0x00000030)
#define  RCC_USBSSPLL_REFSEL_32MHz                   ((uint32_t)0x00000040)
#define  RCC_USBSSPLL_REFSEL_40MHz                   ((uint32_t)0x00000050)
#define  RCC_USBSSPLL_REFSEL_60MHz                   ((uint32_t)0x00000060)
#define  RCC_USBSSPLL_REFSEL_80MHz                   ((uint32_t)0x00000070)

#define  RCC_USBHSPLL_IN_DIV                         ((uint32_t)0x00001F00)
#define  RCC_USBHSPLL_IN_DIV_0                       ((uint32_t)0x00000100)
#define  RCC_USBHSPLL_IN_DIV_1                       ((uint32_t)0x00000200)
#define  RCC_USBHSPLL_IN_DIV_2                       ((uint32_t)0x00000400)
#define  RCC_USBHSPLL_IN_DIV_3                       ((uint32_t)0x00000800)
#define  RCC_USBHSPLL_IN_DIV_4                       ((uint32_t)0x00001000)

