betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
#define  TIM_LOCK                                    ((uint16_t)0x0300)            /* LOCK[1:0] bits (Lock Configuration) */
#define  TIM_LOCK_0                                  ((uint16_t)0x0100)            /* Bit 0 */
#define  TIM_LOCK_1                                  ((uint16_t)0x0200)            /* Bit 1 */
 
#define  TIM_OSSI                                    ((uint16_t)0x0400)            /* Off-State Selection for Idle mode */
#define  TIM_OSSR                                    ((uint16_t)0x0800)            /* Off-State Selection for Run mode */
#define  TIM_BKE                                     ((uint16_t)0x1000)            /* Break enable */
#define  TIM_BKP                                     ((uint16_t)0x2000)            /* Break Polarity */
#define  TIM_AOE                                     ((uint16_t)0x4000)            /* Automatic Output enable */
#define  TIM_MOE                                     ((uint16_t)0x8000)            /* Main Output enable */

/*******************  Bit definition for TIM_DMACFGR register  ********************/
#define  TIM_DBA                                     ((uint16_t)0x001F)            /* DBA[4:0] bits (DMA Base Address) */
#define  TIM_DBA_0                                   ((uint16_t)0x0001)            /* Bit 0 */
#define  TIM_DBA_1                                   ((uint16_t)0x0002)            /* Bit 1 */
#define  TIM_DBA_2                                   ((uint16_t)0x0004)            /* Bit 2 */
#define  TIM_DBA_3                                   ((uint16_t)0x0008)            /* Bit 3 */
#define  TIM_DBA_4                                   ((uint16_t)0x0010)            /* Bit 4 */

#define  TIM_DBL                                     ((uint16_t)0x1F00)            /* DBL[4:0] bits (DMA Burst Length) */
#define  TIM_DBL_0                                   ((uint16_t)0x0100)            /* Bit 0 */
#define  TIM_DBL_1                                   ((uint16_t)0x0200)            /* Bit 1 */
#define  TIM_DBL_2                                   ((uint16_t)0x0400)            /* Bit 2 */
#define  TIM_DBL_3                                   ((uint16_t)0x0800)            /* Bit 3 */
#define  TIM_DBL_4                                   ((uint16_t)0x1000)            /* Bit 4 */

/*******************  Bit definition for TIM_DMAADR register  *******************/
#define  TIM_DMAR_DMAB                               ((uint16_t)0xFFFF)            /* DMA register for burst accesses */

/*******************  Bit definition for TIM_AUX register  *******************/
#define  TIM_AUX_CAPCH2_ED                           ((uint16_t)0x0001)            
#define  TIM_AUX_CAPCH3_ED                           ((uint16_t)0x0002)            
#define  TIM_AUX_CAPCH4_ED                           ((uint16_t)0x0004)            
#define  TIM_AUX_CAPCH234_ED                         ((uint16_t)0x0007)

#define  TIM_AUX_BK_SEL                              ((uint16_t)0x0038)
#define  TIM_AUX_BK_SEL_0                            ((uint16_t)0x0008)
#define  TIM_AUX_BK_SEL_1                            ((uint16_t)0x0010)
#define  TIM_AUX_BK_SEL_2                            ((uint16_t)0x0020)

#define  TIM_AUX_DT_MODE                             ((uint16_t)0x0040)
#define  TIM_AUX_DTN_MODE                            ((uint16_t)0x0080)

#define  TIM_AUX_DT_VLU2                             ((uint16_t)0xFF00)

/******************************************************************************/
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/******************************************************************************/

/*******************  Bit definition for USART_STATR register  *******************/
#define  USART_STATR_PE                              ((uint16_t)0x0001)            /* Parity Error */
#define  USART_STATR_FE                              ((uint16_t)0x0002)            /* Framing Error */
#define  USART_STATR_NE                              ((uint16_t)0x0004)            /* Noise Error Flag */
#define  USART_STATR_ORE                             ((uint16_t)0x0008)            /* OverRun Error */
#define  USART_STATR_IDLE                            ((uint16_t)0x0010)            /* IDLE line detected */
#define  USART_STATR_RXNE                            ((uint16_t)0x0020)            /* Read Data Register Not Empty */
#define  USART_STATR_TC                              ((uint16_t)0x0040)            /* Transmission Complete */
#define  USART_STATR_TXE                             ((uint16_t)0x0080)            /* Transmit Data Register Empty */
#define  USART_STATR_LBD                             ((uint16_t)0x0100)            /* LIN Break Detection Flag */
#define  USART_STATR_CTS                             ((uint16_t)0x0200)            /* CTS Flag */
#define  USART_STATR_RX_BUSY                         ((uint16_t)0x0400)
#define  USART_STATR_MS_ERR                          ((uint16_t)0x0800)
#define  USART_STATR_USART_WKUP                      ((uint16_t)0x8000)

/*******************  Bit definition for USART_DATAR register  *******************/
#define  USART_DATAR_DR                              ((uint16_t)0x01FF)            /* Data value */

/******************  Bit definition for USART_BRR register  *******************/
#define  USART_BRR_DIV_Fraction                      ((uint16_t)0x000F)            /* Fraction of USARTDIV */
#define  USART_BRR_DIV_Mantissa                      ((uint16_t)0xFFF0)            /* Mantissa of USARTDIV */

/******************  Bit definition for USART_CTLR1 register  *******************/
#define  USART_CTLR1_SBK                             ((uint16_t)0x0001)            /* Send Break */
#define  USART_CTLR1_RWU                             ((uint16_t)0x0002)            /* Receiver wakeup */
#define  USART_CTLR1_RE                              ((uint16_t)0x0004)            /* Receiver Enable */
#define  USART_CTLR1_TE                              ((uint16_t)0x0008)            /* Transmitter Enable */
#define  USART_CTLR1_IDLEIE                          ((uint16_t)0x0010)            /* IDLE Interrupt Enable */
#define  USART_CTLR1_RXNEIE                          ((uint16_t)0x0020)            /* RXNE Interrupt Enable */
#define  USART_CTLR1_TCIE                            ((uint16_t)0x0040)            /* Transmission Complete Interrupt Enable */
#define  USART_CTLR1_TXEIE                           ((uint16_t)0x0080)            /* PE Interrupt Enable */
#define  USART_CTLR1_PEIE                            ((uint16_t)0x0100)            /* PE Interrupt Enable */
#define  USART_CTLR1_PS                              ((uint16_t)0x0200)            /* Parity Selection */
#define  USART_CTLR1_PCE                             ((uint16_t)0x0400)            /* Parity Control Enable */
#define  USART_CTLR1_WAKE                            ((uint16_t)0x0800)            /* Wakeup method */
#define  USART_CTLR1_M                               ((uint16_t)0x1000)            /* Word length */
#define  USART_CTLR1_UE                              ((uint16_t)0x2000)            /* USART Enable */

#define  USART_CTLR1_M_EXT                           ((uint16_t)0xC000)
#define  USART_CTLR1_M_EXT_0                         ((uint16_t)0x4000)            
#define  USART_CTLR1_M_EXT_1                         ((uint16_t)0x8000) 

#define  USART_CTLR1_M_EXT5                          ((uint16_t)0xC000) 
#define  USART_CTLR1_M_EXT6                          ((uint16_t)0x8000) 
#define  USART_CTLR1_M_EXT7                          ((uint16_t)0x4000) 

/******************  Bit definition for USART_CTLR2 register  *******************/
#define  USART_CTLR2_ADD                             ((uint16_t)0x000F)            /* Address of the USART node */
#define  USART_CTLR2_LBDL                            ((uint16_t)0x0020)            /* LIN Break Detection Length */
#define  USART_CTLR2_LBDIE                           ((uint16_t)0x0040)            /* LIN Break Detection Interrupt Enable */
#define  USART_CTLR2_LBCL                            ((uint16_t)0x0100)            /* Last Bit Clock pulse */
#define  USART_CTLR2_CPHA                            ((uint16_t)0x0200)            /* Clock Phase */
#define  USART_CTLR2_CPOL                            ((uint16_t)0x0400)            /* Clock Polarity */
#define  USART_CTLR2_CLKEN                           ((uint16_t)0x0800)            /* Clock Enable */

#define  USART_CTLR2_STOP                            ((uint16_t)0x3000)            /* STOP[1:0] bits (STOP bits) */
#define  USART_CTLR2_STOP_0                          ((uint16_t)0x1000)            /* Bit 0 */
#define  USART_CTLR2_STOP_1                          ((uint16_t)0x2000)            /* Bit 1 */

