betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/*******************  Bit definition for DVP_IER register  ********************/
#define	RB_DVP_IE_STR_FRM		                         0x01	 // RW, DVP frame start interrupt enable
#define	RB_DVP_IE_ROW_DONE		                       0x02	 // RW, DVP row received done interrupt enable
#define RB_DVP_IE_FRM_DONE		                       0x04	 // RW, DVP frame received done interrupt enable
#define	RB_DVP_IE_FIFO_OV		                         0x08	 // RW, DVP receive fifo overflow interrupt enable	
#define RB_DVP_IE_STP_FRM		                         0x10	 // RW, DVP frame stop interrupt enable				

/*******************  Bit definition for DVP_ROW_NUM register  ********************/
#define RB_DVP_ROW_NUM                               ((uint16_t)0xFFFF)

/*******************  Bit definition for DVP_COL_NUM register  ********************/
#define RB_DVP_COL_NUM                               ((uint16_t)0xFFFF)

/*******************  Bit definition for DVP_DMA_BUF0 register  ********************/
#define RB_DVP_DMA_BUF0                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for DVP_DMA_BUF1 register  ********************/
#define RB_DVP_DMA_BUF1                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for DVP_IFR register  ********************/
#define RB_DVP_IF_STR_FRM	                           0x01	 // RW1, interrupt flag for DVP frame start
#define RB_DVP_IF_ROW_DONE		                       0x02	 // RW1, interrupt flag for DVP row receive done
#define RB_DVP_IF_FRM_DONE		                       0x04	 // RW1, interrupt flag for DVP frame receive done
#define RB_DVP_IF_FIFO_OV		                         0x08	 // RW1, interrupt flag for DVP receive fifo overflow
#define RB_DVP_IF_STP_FRM		                         0x10	 // RW1, interrupt flag for DVP frame stop

/*******************  Bit definition for DVP_STATUS register  ********************/
#define RB_DVP_FIFO_RDY			                         0x01	 // RO, DVP receive fifo ready
#define RB_DVP_FIFO_FULL		                         0x02	 // RO, DVP receive fifo full
#define RB_DVP_FIFO_OV			                         0x04	 // RO, DVP receive fifo overflow
#define RB_DVP_MSK_FIFO_CNT		                       0x70	 // RO, DVP receive fifo count

/*******************  Bit definition for DVP_ROW_CNT register  ********************/
#define RB_DVP_ROW_CNT			                         ((uint16_t)0xFF)					

/*******************  Bit definition for DVP_HOFFCNT register  ********************/
#define RB_DVP_HOFFCNT			                         ((uint16_t)0xFF)					

/*******************  Bit definition for DVP_VST register  ********************/
#define RB_DVP_VST     			                         ((uint16_t)0xFF)				

/*******************  Bit definition for DVP_CAPCNT register  ********************/
#define RB_DVP_CAPCNT     	                         ((uint16_t)0xFF)

/*******************  Bit definition for DVP_VLINE register  ********************/
#define RB_DVP_VLINE                                 ((uint16_t)0xFF)

/*******************  Bit definition for DVP_DR register  ********************/
#define RB_DVP_DR         	                         ((uint16_t)0xFF)

/******************************************************************************/
/*                                  TKEY                                       */
/******************************************************************************/

/*******************  Bit definition for TKEY_CHARGE1 register  *******************/
#define  TKEY_CHARGE1_TKCG10                         ((uint32_t)0x0007)            
#define  TKEY_CHARGE1_TKCG10_1C5                     ((uint32_t)0x0000)
#define  TKEY_CHARGE1_TKCG10_7C5                     ((uint32_t)0x0001)
#define  TKEY_CHARGE1_TKCG10_13C5                    ((uint32_t)0x0002)
#define  TKEY_CHARGE1_TKCG10_28C5                    ((uint32_t)0x0003)
#define  TKEY_CHARGE1_TKCG10_41C5                    ((uint32_t)0x0004)
#define  TKEY_CHARGE1_TKCG10_55C5                    ((uint32_t)0x0005)
#define  TKEY_CHARGE1_TKCG10_71C5                    ((uint32_t)0x0006)
#define  TKEY_CHARGE1_TKCG10_239C5                   ((uint32_t)0x0007)

#define  TKEY_CHARGE1_TKCG11                         ((uint32_t)0x0038)            
#define  TKEY_CHARGE1_TKCG11_1C5                     ((uint32_t)0x0000)
#define  TKEY_CHARGE1_TKCG11_7C5                     ((uint32_t)0x0008)
#define  TKEY_CHARGE1_TKCG11_13C5                    ((uint32_t)0x0010)
#define  TKEY_CHARGE1_TKCG11_28C5                    ((uint32_t)0x0018)
#define  TKEY_CHARGE1_TKCG11_41C5                    ((uint32_t)0x0020)
#define  TKEY_CHARGE1_TKCG11_55C5                    ((uint32_t)0x0028)
#define  TKEY_CHARGE1_TKCG11_71C5                    ((uint32_t)0x0030)
#define  TKEY_CHARGE1_TKCG11_239C5                   ((uint32_t)0x0038)

#define  TKEY_CHARGE1_TKCG12                         ((uint32_t)0x01C0)            
#define  TKEY_CHARGE1_TKCG12_1C5                     ((uint32_t)0x0000)
#define  TKEY_CHARGE1_TKCG12_7C5                     ((uint32_t)0x0040)
#define  TKEY_CHARGE1_TKCG12_13C5                    ((uint32_t)0x0080)
#define  TKEY_CHARGE1_TKCG12_28C5                    ((uint32_t)0x00C0)
#define  TKEY_CHARGE1_TKCG12_41C5                    ((uint32_t)0x0100)
#define  TKEY_CHARGE1_TKCG12_55C5                    ((uint32_t)0x0140)
#define  TKEY_CHARGE1_TKCG12_71C5                    ((uint32_t)0x0180)
#define  TKEY_CHARGE1_TKCG12_239C5                   ((uint32_t)0x01C0)

#define  TKEY_CHARGE1_TKCG13                         ((uint32_t)0x0E00)            
#define  TKEY_CHARGE1_TKCG13_1C5                     ((uint32_t)0x0000)
#define  TKEY_CHARGE1_TKCG13_7C5                     ((uint32_t)0x0200)
#define  TKEY_CHARGE1_TKCG13_13C5                    ((uint32_t)0x0400)
#define  TKEY_CHARGE1_TKCG13_28C5                    ((uint32_t)0x0600)
#define  TKEY_CHARGE1_TKCG13_41C5                    ((uint32_t)0x0800)
#define  TKEY_CHARGE1_TKCG13_55C5                    ((uint32_t)0x0A00)
#define  TKEY_CHARGE1_TKCG13_71C5                    ((uint32_t)0x0C00)
#define  TKEY_CHARGE1_TKCG13_239C5                   ((uint32_t)0x0E00)

