betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
#define  TKEY_CHARGE1_TKCG14                         ((uint32_t)0x7000)            
#define  TKEY_CHARGE1_TKCG15                         ((uint32_t)0x38000)            

/******************************************************************************/
/*                                  SDMMC                                       */
/******************************************************************************/
/*******************  Bit definition for EMMC_ARGUMENT register  *******************/
#define  EMMC_ARGUMENT                               ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for EMMC_CMD_SET register  *******************/
#define  EMMC_CMDIDX_MASK                            ((uint16_t)0x003F)
#define  EMMC_RPTY_MASK                              ((uint16_t)0x0300)
#define  EMMC_CKCRC                                  ((uint16_t)0x0400)
#define  EMMC_CKIDX                                  ((uint16_t)0x0800)

/*******************  Bit definition for EMMC_RESPONSE0 register  *******************/
#define  EMMC_RESPONSE0                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for EMMC_RESPONSE1 register  *******************/
#define  EMMC_RESPONSE1                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for EMMC_RESPONSE2 register  *******************/
#define  EMMC_RESPONSE2                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for EMMC_RESPONSE3 register  *******************/
#define  EMMC_RESPONSE3                              ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for EMMC_WRITE_CONT register  *******************/
#define  EMMC_WRITE_CONT                             ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for EMMC_CONTROL register  *******************/
#define  EMMC_LW_MASK                                ((uint16_t)0x0003)
#define  EMMC_LW_MASK_0                              ((uint16_t)0x0001)
#define  EMMC_LW_MASK_1                              ((uint16_t)0x0002)

#define  EMMC_ALL_CLR                                ((uint16_t)0x0004)
#define  EMMC_DMAEN                                  ((uint16_t)0x0008)
#define  EMMC_RST_LGC                                ((uint16_t)0x0010)
#define  EMMC_NEGSMP                                 ((uint16_t)0x0020)
#define  EMMC_SLV_MODE                               ((uint16_t)0x0100)
#define  EMMC_SLV_FORCE_ERR                          ((uint16_t)000200)

/*******************  Bit definition for EMMC_TIMEOUT register  *******************/
#define  EMMC_TOCNT_MASK                             ((uint8_t)0x0F)

/*******************  Bit definition for EMMC_STATUS register  *******************/
#define  EMMC_MASK_BLOCK_NUM                         ((uint16_t)0xFFFF)
#define  EMMC_CMDSTA                                 ((uint32_t)0x00010000)
#define  EMMC_DAT0STA                                ((uint32_t)0x00020000)

/*******************  Bit definition for EMMC_INT_FG register  *******************/
#define  EMMC_IF_RE_TMOUT                            ((uint16_t)0x0001)
#define  EMMC_IF_RECRC_WR                            ((uint16_t)0x0002)
#define  EMMC_IF_REIDX_ER                            ((uint16_t)0x0004)
#define  EMMC_IF_CMDDONE                             ((uint16_t)0x0008)
#define  EMMC_IF_DATTMO                              ((uint16_t)0x0010)
#define  EMMC_IF_TRANERR                             ((uint16_t)0x0020)
#define  EMMC_IF_TRANDONE                            ((uint16_t)0x0040)
#define  EMMC_IF_BKGAP                               ((uint16_t)0x0080)
#define  EMMC_IF_FIFO_OV                             ((uint16_t)0x0100)
#define  EMMC_IF_SDIOINT                             ((uint16_t)0x0200)
#define  EMMC_SIF_SLV_BUF_RELEAS                     ((uint16_t)0x0400)

/*******************  Bit definition for EMMC_INT_EN register  *******************/
#define  EMMC_IE_RE_TMOUT                            ((uint16_t)0x0001)
#define  EMMC_IE_RECRC_WR                            ((uint16_t)0x0002)
#define  EMMC_IE_REIDX_ER                            ((uint16_t)0x0004)
#define  EMMC_IE_CMDDONE                             ((uint16_t)0x0008)
#define  EMMC_IE_DATTMO                              ((uint16_t)0x0010)
#define  EMMC_IE_TRANERR                             ((uint16_t)0x0020)
#define  EMMC_IE_TRANDONE                            ((uint16_t)0x0040)
#define  EMMC_IE_FIFO_OV                             ((uint16_t)0x0080)
#define  EMMC_IE_SDIOINT                             ((uint16_t)0x0100)

/*******************  Bit definition for EMMC_DMA_BEG1 register  *******************/
#define  EMMC_DMAAD1_MASK                            ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for EMMC_BLOCK_CFG register  *******************/
#define  EMMC_BKNUM_MASK                             ((uint32_t)0x0000FFFF)
#define  EMMC_BKSIZE_MASK                            ((uint32_t)0x0FFF0000)

/*******************  Bit definition for EMMC_TRAN_MODE register  *******************/
#define  EMMC_DMA_DIR                                ((uint32_t)0x00000001)
#define  EMMC_GAP_STOP                               ((uint32_t)0x00000002)
#define  EMMC_MODE_BOOT                              ((uint32_t)0x00000004)
#define  EMMC_AUTOGAPSTOP                            ((uint32_t)0x00000010)

#define  EMMC_DMATN_CNT                              ((uint32_t)0x00007F00)

#define  EMMC_DULEDMA_EN                             ((uint32_t)0x00010000)
#define  EMMC_DDR_MODE                               ((uint32_t)0x00020000)
#define  EMMC_CARE_NEG                               ((uint32_t)0x00040000)

#define  EMMC_SW                                     ((uint32_t)0x00180000)
#define  EMMC_SW_0                                   ((uint32_t)0x00080000)
#define  EMMC_SW_1                                   ((uint32_t)0x00100000)

/*******************  Bit definition for EMMC_CLK_DIV register  *******************/
#define  EMMC_DIV_MASK                               ((uint32_t)0x0000000F)
#define  EMMC_CLKOE                                  ((uint32_t)0x00000100)
#define  EMMC_CLKMode                                ((uint32_t)0x00000200)
#define  EMMC_PHASEINV                               ((uint32_t)0x00000400)

/*******************  Bit definition for EMMC_DMA_BEG2 register  *******************/
#define  EMMC_DMAAD2_MASK                            ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for EMMC_TUNE_DATO register  *******************/
#define  EMMC_TUNNE_DAT0_O                           ((uint32_t)0x0000000F)
#define  EMMC_TUNNE_DAT1_O                           ((uint32_t)0x000000F0)
#define  EMMC_TUNNE_DAT2_O                           ((uint32_t)0x00000F00)
#define  EMMC_TUNNE_DAT3_O                           ((uint32_t)0x0000F000)
#define  EMMC_TUNNE_DAT4_O                           ((uint32_t)0x000F0000)
#define  EMMC_TUNNE_DAT5_O                           ((uint32_t)0x00F00000)
#define  EMMC_TUNNE_DAT6_O                           ((uint32_t)0x0F000000)
#define  EMMC_TUNNE_DAT7_O                           ((uint32_t)0xF0000000)

