betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
#define  FMC_BCR1_MTYP                               ((uint32_t)0x0000000C)
#define  FMC_BCR1_MTYP_0                             ((uint32_t)0x00000004)
#define  FMC_BCR1_MTYP_1                             ((uint32_t)0x00000008)

#define  FMC_BCR1_MWID                               ((uint32_t)0x00000030)
#define  FMC_BCR1_MWID_0                             ((uint32_t)0x00000010)
#define  FMC_BCR1_MWID_1                             ((uint32_t)0x00000020)

#define  FMC_BCR1_MFACCEN                            ((uint32_t)0x00000040)
#define  FMC_BCR1_BURSTEN                            ((uint32_t)0x00000100)
#define  FMC_BCR1_WAITPOL                            ((uint32_t)0x00000200)
#define  FMC_BCR1_WAITCFG                            ((uint32_t)0x00000800)

#define  FMC_BCR1_WREN                               ((uint32_t)0x00001000)
#define  FMC_BCR1_WAITEN                             ((uint32_t)0x00002000)
#define  FMC_BCR1_EXTMOD                             ((uint32_t)0x00004000)
#define  FMC_BCR1_ASYNCWAIT                          ((uint32_t)0x00008000)

#define  FMC_BCR1_CPSIZE                             ((uint32_t)0x00070000)
#define  FMC_BCR1_CPSIZE_0                           ((uint32_t)0x00010000)
#define  FMC_BCR1_CPSIZE_1                           ((uint32_t)0x00020000)
#define  FMC_BCR1_CPSIZE_2                           ((uint32_t)0x00040000)

#define  FMC_BCR1_CBURSTRW                           ((uint32_t)0x00080000)

#define  FMC_BCR1_BMP                                ((uint32_t)0x03000000)
#define  FMC_BCR1_BMP_0                              ((uint32_t)0x01000000)
#define  FMC_BCR1_BMP_1                              ((uint32_t)0x02000000)

#define  FMC_BCR1_FMCEN                              ((uint32_t)0x80000000)

/*******************  Bit definition for FMC_BCR2 register  *******************/
#define  FMC_BCR2_MBKEN                              ((uint32_t)0x00000001)
#define  FMC_BCR2_MUXEN                              ((uint32_t)0x00000002)

#define  FMC_BCR2_MTYP                               ((uint32_t)0x0000000C)
#define  FMC_BCR2_MTYP_0                             ((uint32_t)0x00000004)
#define  FMC_BCR2_MTYP_1                             ((uint32_t)0x00000008)

#define  FMC_BCR2_MWID                               ((uint32_t)0x00000030)
#define  FMC_BCR2_MWID_0                             ((uint32_t)0x00000010)
#define  FMC_BCR2_MWID_1                             ((uint32_t)0x00000020)

#define  FMC_BCR2_FACCEN                             ((uint32_t)0x00000040)
#define  FMC_BCR2_BURSTEN                            ((uint32_t)0x00000100)
#define  FMC_BCR2_WAITPOL                            ((uint32_t)0x00000200)
#define  FMC_BCR2_WAITCFG                            ((uint32_t)0x00000800)
#define  FMC_BCR2_WREN                               ((uint32_t)0x00001000)
#define  FMC_BCR2_WAITEN                             ((uint32_t)0x00002000)
#define  FMC_BCR2_EXTMOD                             ((uint32_t)0x00004000)
#define  FMC_BCR2_ASYNCWAIT                          ((uint32_t)0x00008000)

#define  FMC_BCR2_CPSZIE                             ((uint32_t)0x00070000)
#define  FMC_BCR2_CPSZIE_0                           ((uint32_t)0x00010000)
#define  FMC_BCR2_CPSZIE_1                           ((uint32_t)0x00020000)
#define  FMC_BCR2_CPSZIE_2                           ((uint32_t)0x00040000)

#define  FMC_BCR2_CBURSTRW                           ((uint32_t)0x00080000)
#define  FMC_BCR2_BMP                                ((uint32_t)0x03000000)
#define  FMC_BCR2_BMP_0                              ((uint32_t)0x01000000)
#define  FMC_BCR2_BMP_1                              ((uint32_t)0x02000000)

#define  FMC_BCR2_FMCEN                              ((uint32_t)0x80000000)

/*******************  Bit definition for FMC_BCR3 register  *******************/
#define  FMC_BCR3_MBKEN                              ((uint32_t)0x00000001)
#define  FMC_BCR3_MUXEN                              ((uint32_t)0x00000002)

#define  FMC_BCR3_MTYP                               ((uint32_t)0x0000000C)
#define  FMC_BCR3_MTYP_0                             ((uint32_t)0x00000004)
#define  FMC_BCR3_MTYP_1                             ((uint32_t)0x00000008)

#define  FMC_BCR3_MWID                               ((uint32_t)0x00000030)
#define  FMC_BCR3_MWID_0                             ((uint32_t)0x00000010)
#define  FMC_BCR3_MWID_1                             ((uint32_t)0x00000020)

#define  FMC_BCR3_FACCEN                             ((uint32_t)0x00000040)
#define  FMC_BCR3_BURSTEN                            ((uint32_t)0x00000100)
#define  FMC_BCR3_WAITPOL                            ((uint32_t)0x00000200)
#define  FMC_BCR3_WAITCFG                            ((uint32_t)0x00000800)
#define  FMC_BCR3_WREN                               ((uint32_t)0x00001000)
#define  FMC_BCR3_WAITEN                             ((uint32_t)0x00002000)
#define  FMC_BCR3_EXTMOD                             ((uint32_t)0x00004000)
#define  FMC_BCR3_ASYNCWAIT                          ((uint32_t)0x00008000)

#define  FMC_BCR3_CPSZIE                             ((uint32_t)0x00070000)
#define  FMC_BCR3_CPSZIE_0                           ((uint32_t)0x00010000)
#define  FMC_BCR3_CPSZIE_1                           ((uint32_t)0x00020000)
#define  FMC_BCR3_CPSZIE_2                           ((uint32_t)0x00040000)

#define  FMC_BCR3_CBURSTRW                           ((uint32_t)0x00080000)
#define  FMC_BCR3_BMP                                ((uint32_t)0x03000000)
#define  FMC_BCR3_BMP_0                              ((uint32_t)0x01000000)
#define  FMC_BCR3_BMP_1                              ((uint32_t)0x02000000)

#define  FMC_BCR3_FMCEN                              ((uint32_t)0x80000000)

/*******************  Bit definition for FMC_BCR4 register  *******************/
#define  FMC_BCR4_MBKEN                              ((uint32_t)0x00000001)
#define  FMC_BCR4_MUXEN                              ((uint32_t)0x00000002)

#define  FMC_BCR4_MTYP                               ((uint32_t)0x0000000C)
#define  FMC_BCR4_MTYP_0                             ((uint32_t)0x00000004)
#define  FMC_BCR4_MTYP_1                             ((uint32_t)0x00000008)

#define  FMC_BCR4_MWID                               ((uint32_t)0x00000030)
#define  FMC_BCR4_MWID_0                             ((uint32_t)0x00000010)
#define  FMC_BCR4_MWID_1                             ((uint32_t)0x00000020)

#define  FMC_BCR4_FACCEN                             ((uint32_t)0x00000040)
#define  FMC_BCR4_BURSTEN                            ((uint32_t)0x00000100)
#define  FMC_BCR4_WAITPOL                            ((uint32_t)0x00000200)
#define  FMC_BCR4_WAITCFG                            ((uint32_t)0x00000800)
#define  FMC_BCR4_WREN                               ((uint32_t)0x00001000)
#define  FMC_BCR4_WAITEN                             ((uint32_t)0x00002000)
#define  FMC_BCR4_EXTMOD                             ((uint32_t)0x00004000)
#define  FMC_BCR4_ASYNCWAIT                          ((uint32_t)0x00008000)

#define  FMC_BCR4_CPSZIE                             ((uint32_t)0x00070000)
#define  FMC_BCR4_CPSZIE_0                           ((uint32_t)0x00010000)
#define  FMC_BCR4_CPSZIE_1                           ((uint32_t)0x00020000)
#define  FMC_BCR4_CPSZIE_2                           ((uint32_t)0x00040000)

#define  FMC_BCR4_CBURSTRW                           ((uint32_t)0x00080000)
#define  FMC_BCR4_BMP                                ((uint32_t)0x03000000)
#define  FMC_BCR4_BMP_0                              ((uint32_t)0x01000000)
#define  FMC_BCR4_BMP_1                              ((uint32_t)0x02000000)

