betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
#define  FMC_BWTR1_DATAST                            ((uint32_t)0x0000FF00)
#define  FMC_BWTR1_DATAST_0                          ((uint32_t)0x00000100)
#define  FMC_BWTR1_DATAST_1                          ((uint32_t)0x00000200)
#define  FMC_BWTR1_DATAST_2                          ((uint32_t)0x00000400)
#define  FMC_BWTR1_DATAST_3                          ((uint32_t)0x00000800)
#define  FMC_BWTR1_DATAST_4                          ((uint32_t)0x00001000)
#define  FMC_BWTR1_DATAST_5                          ((uint32_t)0x00002000)
#define  FMC_BWTR1_DATAST_6                          ((uint32_t)0x00004000)
#define  FMC_BWTR1_DATAST_7                          ((uint32_t)0x00008000)

#define  FMC_BWTR1_BUSTURN                           ((uint32_t)0x000F0000)
#define  FMC_BWTR1_BUSTURN_0                         ((uint32_t)0x00010000)
#define  FMC_BWTR1_BUSTURN_1                         ((uint32_t)0x00020000)
#define  FMC_BWTR1_BUSTURN_2                         ((uint32_t)0x00040000)
#define  FMC_BWTR1_BUSTURN_3                         ((uint32_t)0x00080000)

#define  FMC_BWTR1_ACCMOD                            ((uint32_t)0x30000000)
#define  FMC_BWTR1_ACCMOD_0                          ((uint32_t)0x10000000)
#define  FMC_BWTR1_ACCMOD_1                          ((uint32_t)0x20000000)

/*******************  Bit definition for FMC_BWTR2 register  *******************/
#define  FMC_BWTR2_ADDSET                            ((uint32_t)0x0000000F)
#define  FMC_BWTR2_ADDSET_0                          ((uint32_t)0x00000001)
#define  FMC_BWTR2_ADDSET_1                          ((uint32_t)0x00000002)
#define  FMC_BWTR2_ADDSET_2                          ((uint32_t)0x00000004)
#define  FMC_BWTR2_ADDSET_3                          ((uint32_t)0x00000008)

#define  FMC_BWTR2_ADDHLD                            ((uint32_t)0x000000F0)
#define  FMC_BWTR2_ADDHLD_0                          ((uint32_t)0x00000010)
#define  FMC_BWTR2_ADDHLD_1                          ((uint32_t)0x00000020)
#define  FMC_BWTR2_ADDHLD_2                          ((uint32_t)0x00000040)
#define  FMC_BWTR2_ADDHLD_3                          ((uint32_t)0x00000080)

#define  FMC_BWTR2_DATAST                            ((uint32_t)0x0000FF00)
#define  FMC_BWTR2_DATAST_0                          ((uint32_t)0x00000100)
#define  FMC_BWTR2_DATAST_1                          ((uint32_t)0x00000200)
#define  FMC_BWTR2_DATAST_2                          ((uint32_t)0x00000400)
#define  FMC_BWTR2_DATAST_3                          ((uint32_t)0x00000800)
#define  FMC_BWTR2_DATAST_4                          ((uint32_t)0x00001000)
#define  FMC_BWTR2_DATAST_5                          ((uint32_t)0x00002000)
#define  FMC_BWTR2_DATAST_6                          ((uint32_t)0x00004000)
#define  FMC_BWTR2_DATAST_7                          ((uint32_t)0x00008000)

#define  FMC_BWTR2_BUSTURN                           ((uint32_t)0x000F0000)
#define  FMC_BWTR2_BUSTURN_0                         ((uint32_t)0x00010000)
#define  FMC_BWTR2_BUSTURN_1                         ((uint32_t)0x00020000)
#define  FMC_BWTR2_BUSTURN_2                         ((uint32_t)0x00040000)
#define  FMC_BWTR2_BUSTURN_3                         ((uint32_t)0x00080000)

#define  FMC_BWTR2_ACCMOD                            ((uint32_t)0x30000000)
#define  FMC_BWTR2_ACCMOD_0                          ((uint32_t)0x10000000)
#define  FMC_BWTR2_ACCMOD_1                          ((uint32_t)0x20000000)

/*******************  Bit definition for FMC_BWTR3 register  *******************/
#define  FMC_BWTR3_ADDSET                            ((uint32_t)0x0000000F)
#define  FMC_BWTR3_ADDSET_0                          ((uint32_t)0x00000001)
#define  FMC_BWTR3_ADDSET_1                          ((uint32_t)0x00000002)
#define  FMC_BWTR3_ADDSET_2                          ((uint32_t)0x00000004)
#define  FMC_BWTR3_ADDSET_3                          ((uint32_t)0x00000008)

#define  FMC_BWTR3_ADDHLD                            ((uint32_t)0x000000F0)
#define  FMC_BWTR3_ADDHLD_0                          ((uint32_t)0x00000010)
#define  FMC_BWTR3_ADDHLD_1                          ((uint32_t)0x00000020)
#define  FMC_BWTR3_ADDHLD_2                          ((uint32_t)0x00000040)
#define  FMC_BWTR3_ADDHLD_3                          ((uint32_t)0x00000080)

#define  FMC_BWTR3_DATAST                            ((uint32_t)0x0000FF00)
#define  FMC_BWTR3_DATAST_0                          ((uint32_t)0x00000100)
#define  FMC_BWTR3_DATAST_1                          ((uint32_t)0x00000200)
#define  FMC_BWTR3_DATAST_2                          ((uint32_t)0x00000400)
#define  FMC_BWTR3_DATAST_3                          ((uint32_t)0x00000800)
#define  FMC_BWTR3_DATAST_4                          ((uint32_t)0x00001000)
#define  FMC_BWTR3_DATAST_5                          ((uint32_t)0x00002000)
#define  FMC_BWTR3_DATAST_6                          ((uint32_t)0x00004000)
#define  FMC_BWTR3_DATAST_7                          ((uint32_t)0x00008000)

#define  FMC_BWTR3_BUSTURN                           ((uint32_t)0x000F0000)
#define  FMC_BWTR3_BUSTURN_0                         ((uint32_t)0x00010000)
#define  FMC_BWTR3_BUSTURN_1                         ((uint32_t)0x00020000)
#define  FMC_BWTR3_BUSTURN_2                         ((uint32_t)0x00040000)
#define  FMC_BWTR3_BUSTURN_3                         ((uint32_t)0x00080000)

#define  FMC_BWTR3_ACCMOD                            ((uint32_t)0x30000000)
#define  FMC_BWTR3_ACCMOD_0                          ((uint32_t)0x10000000)
#define  FMC_BWTR3_ACCMOD_1                          ((uint32_t)0x20000000)

/*******************  Bit definition for FMC_BWTR4 register  *******************/
#define  FMC_BWTR4_ADDSET                            ((uint32_t)0x0000000F)
#define  FMC_BWTR4_ADDSET_0                          ((uint32_t)0x00000001)
#define  FMC_BWTR4_ADDSET_1                          ((uint32_t)0x00000002)
#define  FMC_BWTR4_ADDSET_2                          ((uint32_t)0x00000004)
#define  FMC_BWTR4_ADDSET_3                          ((uint32_t)0x00000008)

#define  FMC_BWTR4_ADDHLD                            ((uint32_t)0x000000F0)
#define  FMC_BWTR4_ADDHLD_0                          ((uint32_t)0x00000010)
#define  FMC_BWTR4_ADDHLD_1                          ((uint32_t)0x00000020)
#define  FMC_BWTR4_ADDHLD_2                          ((uint32_t)0x00000040)
#define  FMC_BWTR4_ADDHLD_3                          ((uint32_t)0x00000080)

#define  FMC_BWTR4_DATAST                            ((uint32_t)0x0000FF00)
#define  FMC_BWTR4_DATAST_0                          ((uint32_t)0x00000100)
#define  FMC_BWTR4_DATAST_1                          ((uint32_t)0x00000200)
#define  FMC_BWTR4_DATAST_2                          ((uint32_t)0x00000400)
#define  FMC_BWTR4_DATAST_3                          ((uint32_t)0x00000800)
#define  FMC_BWTR4_DATAST_4                          ((uint32_t)0x00001000)
#define  FMC_BWTR4_DATAST_5                          ((uint32_t)0x00002000)
#define  FMC_BWTR4_DATAST_6                          ((uint32_t)0x00004000)
#define  FMC_BWTR4_DATAST_7                          ((uint32_t)0x00008000)

