betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417.h
/*******************  Bit definition for FMC_SDTR1 register  *******************/
#define  FMC_SDTR1_TMRD                              ((uint32_t)0x0000000F)
#define  FMC_SDTR1_TMRD_0                            ((uint32_t)0x00000001)
#define  FMC_SDTR1_TMRD_1                            ((uint32_t)0x00000002)
#define  FMC_SDTR1_TMRD_2                            ((uint32_t)0x00000004)
#define  FMC_SDTR1_TMRD_3                            ((uint32_t)0x00000008)

#define  FMC_SDTR1_TXSR                              ((uint32_t)0x000000F0)
#define  FMC_SDTR1_TXSR_0                            ((uint32_t)0x00000010)
#define  FMC_SDTR1_TXSR_2                            ((uint32_t)0x00000020)
#define  FMC_SDTR1_TXSR_4                            ((uint32_t)0x00000040)
#define  FMC_SDTR1_TXSR_8                            ((uint32_t)0x00000080)

#define  FMC_SDTR1_TRAS                              ((uint32_t)0x00000F00)
#define  FMC_SDTR1_TRAS_0                            ((uint32_t)0x00000100)
#define  FMC_SDTR1_TRAS_1                            ((uint32_t)0x00000200)
#define  FMC_SDTR1_TRAS_2                            ((uint32_t)0x00000400)
#define  FMC_SDTR1_TRAS_3                            ((uint32_t)0x00000800)

#define  FMC_SDTR1_TRC                               ((uint32_t)0x0000F000)
#define  FMC_SDTR1_TRC_0                             ((uint32_t)0x00001000)
#define  FMC_SDTR1_TRC_1                             ((uint32_t)0x00002000)
#define  FMC_SDTR1_TRC_2                             ((uint32_t)0x00004000)
#define  FMC_SDTR1_TRC_3                             ((uint32_t)0x00008000)

#define  FMC_SDTR1_TWR                               ((uint32_t)0x000F0000)
#define  FMC_SDTR1_TWR_0                             ((uint32_t)0x00010000)
#define  FMC_SDTR1_TWR_1                             ((uint32_t)0x00020000)
#define  FMC_SDTR1_TWR_2                             ((uint32_t)0x00040000)
#define  FMC_SDTR1_TWR_3                             ((uint32_t)0x00080000)

#define  FMC_SDTR1_TRP                               ((uint32_t)0x00F00000)
#define  FMC_SDTR1_TRP_0                             ((uint32_t)0x00100000)
#define  FMC_SDTR1_TRP_2                             ((uint32_t)0x00200000)
#define  FMC_SDTR1_TRP_3                             ((uint32_t)0x00400000)
#define  FMC_SDTR1_TRP_4                             ((uint32_t)0x00800000)

#define  FMC_SDTR1_TRCD                              ((uint32_t)0x0F000000)
#define  FMC_SDTR1_TRCD_0                            ((uint32_t)0x01000000)
#define  FMC_SDTR1_TRCD_1                            ((uint32_t)0x02000000)
#define  FMC_SDTR1_TRCD_2                            ((uint32_t)0x04000000)
#define  FMC_SDTR1_TRCD_3                            ((uint32_t)0x08000000)

/*******************  Bit definition for FMC_SDTR2 register  *******************/
#define  FMC_SDTR2_TMRD                              ((uint32_t)0x0000000F)
#define  FMC_SDTR2_TMRD_0                            ((uint32_t)0x00000001)
#define  FMC_SDTR2_TMRD_1                            ((uint32_t)0x00000002)
#define  FMC_SDTR2_TMRD_2                            ((uint32_t)0x00000004)
#define  FMC_SDTR2_TMRD_3                            ((uint32_t)0x00000008)

#define  FMC_SDTR2_TXSR                              ((uint32_t)0x000000F0)
#define  FMC_SDTR2_TXSR_0                            ((uint32_t)0x00000010)
#define  FMC_SDTR2_TXSR_2                            ((uint32_t)0x00000020)
#define  FMC_SDTR2_TXSR_4                            ((uint32_t)0x00000040)
#define  FMC_SDTR2_TXSR_8                            ((uint32_t)0x00000080)

#define  FMC_SDTR2_TRAS                              ((uint32_t)0x00000F00)
#define  FMC_SDTR2_TRAS_0                            ((uint32_t)0x00000100)
#define  FMC_SDTR2_TRAS_1                            ((uint32_t)0x00000200)
#define  FMC_SDTR2_TRAS_2                            ((uint32_t)0x00000400)
#define  FMC_SDTR2_TRAS_3                            ((uint32_t)0x00000800)

#define  FMC_SDTR2_TRC                               ((uint32_t)0x0000F000)
#define  FMC_SDTR2_TRC_0                             ((uint32_t)0x00001000)
#define  FMC_SDTR2_TRC_1                             ((uint32_t)0x00002000)
#define  FMC_SDTR2_TRC_2                             ((uint32_t)0x00004000)
#define  FMC_SDTR2_TRC_3                             ((uint32_t)0x00008000)

#define  FMC_SDTR2_TWR                               ((uint32_t)0x000F0000)
#define  FMC_SDTR2_TWR_0                             ((uint32_t)0x00010000)
#define  FMC_SDTR2_TWR_1                             ((uint32_t)0x00020000)
#define  FMC_SDTR2_TWR_2                             ((uint32_t)0x00040000)
#define  FMC_SDTR2_TWR_3                             ((uint32_t)0x00080000)

#define  FMC_SDTR2_TRP                               ((uint32_t)0x00F00000)
#define  FMC_SDTR2_TRP_0                             ((uint32_t)0x00100000)
#define  FMC_SDTR2_TRP_2                             ((uint32_t)0x00200000)
#define  FMC_SDTR2_TRP_3                             ((uint32_t)0x00400000)
#define  FMC_SDTR2_TRP_4                             ((uint32_t)0x00800000)

#define  FMC_SDTR2_TRCD                              ((uint32_t)0x0F000000)
#define  FMC_SDTR2_TRCD_0                            ((uint32_t)0x01000000)
#define  FMC_SDTR2_TRCD_1                            ((uint32_t)0x02000000)
#define  FMC_SDTR2_TRCD_2                            ((uint32_t)0x04000000)
#define  FMC_SDTR2_TRCD_3                            ((uint32_t)0x08000000)

/*******************  Bit definition for FMC_SDCMR register  *******************/
#define  FMC_SDCMR_MODE                              ((uint32_t)0x00000007)
#define  FMC_SDCMR_MODE_0                            ((uint32_t)0x00000001)
#define  FMC_SDCMR_MODE_1                            ((uint32_t)0x00000002)
#define  FMC_SDCMR_MODE_2                            ((uint32_t)0x00000004)

#define  FMC_SDCMR_CTB2                              ((uint32_t)0x00000008)
#define  FMC_SDCMR_CTB1                              ((uint32_t)0x00000010)

#define  FMC_SDCMR_NRFS                              ((uint32_t)0x000001E0)
#define  FMC_SDCMR_NRFS_0                            ((uint32_t)0x00000020)
#define  FMC_SDCMR_NRFS_1                            ((uint32_t)0x00000040)
#define  FMC_SDCMR_NRFS_2                            ((uint32_t)0x00000080)
#define  FMC_SDCMR_NRFS_3                            ((uint32_t)0x00000100)

#define  FMC_SDCMR_MRD                               ((uint32_t)0x003FFE00)

/*******************  Bit definition for FMC_SDRTR register  *******************/
#define  FMC_SDRTR_CRE                               ((uint32_t)0x00000001)
#define  FMC_SDRTR_COUNT                             ((uint32_t)0x00003FFE)
#define  FMC_SDRTR_REIE                              ((uint32_t)0x00004000)

